[
  {
    "title": "أمن الحاسوب",
    "article": "تعديل  تعديل مصدري  تعديل ويكي بياناتأمن الحاسوب أو الأمن السيبراني بالإنجليزية Cybersecurity or Computer security‏ هو فرع من فروع تكنولوجيا أمن المعلومات ويختص بالحاسوب والشبكات123 هدفه حماية المعلومات والممتلكات من الدخول غير المصرح والسرقة والتخريب والكوارث الطبيعية ويضمن توافر المعلومات والممتلكات وبقائها منتجة وفي متناول مستخدميها المستهدفينويهتم بالعمليات والآليات الجماعية التي من خلالها تٌحمى المعلومات والخدمات الحساسة والقيمة من النشر والعبث بها أو الإنهيار الذي تسببه الأنشطة غير المأذون بها أو الأفراد غير الجديرين بالثقة والأحداث غير المخطط لها على التوالي أو بعبارة أخرى هو الجهد المستمر لحماية الأنظمة والبيانات المتصلة بالشبكة من الاستخدام غير المصرح بههناك عدة شهادات في مجال الأمن السيبراني أو الأمن المعلوماتي مثل شهادة شركة كومبتيا Securityتقنيات أمن الحاسوب مبنية على المنطق بما أن الأمن ليس بالضرورة الهدف الرئيسي لمعظم تطبيقات الحاسوب فإن تصميم برنامج حاملا الأمن في البال كثيرا ما يفرض قيودا على سلوك هذا البرنامجتوجد عدة طرق للأمن في مجال الحوسبة وأحيانا يسمح بمزيج من المقارباتنظم عديدة أسفرت عن الاحتمال الأول من دون قصد وبما أن المنهجية الثانية مكلفة وغير قطعية فاستخدامها محدود جدا والمنهجيات واحد وثلاثة تؤدي إلى الفشل ولأن المنهجية رقم أربعة غالبا ما تقوم على آليات الأجهزة وتبتعد عن التجريدات وتعدد درجات الحرية فإنها عملية أكثر مزيج من الطريقتين رقم اثنين ورقم أاربعة غالبا ما تستخدم في البنية ذات الطبقات مع طبقات رقيقة من اثنين وطبقات سميكة من أربعةهناك استراتيجيات وتقنيات مختلفة مستخدمة في تصميم أنظمة الأمن ومع ذلك فهناك عدد قليل إن وجد من الاستراتيجيات الفعالة لتعزيز الأمن بعد التصميم أحد الأساليب يفرض مبدأ الامتيازات الأقل إلى الحد الأعلى حيث يمتلك الكيان الامتيازات المحتاجة لوظيفته فقط وبهذه الطريقة حتى لو استطاع المهاجم الوصول إلى جزء من النظام فالأمن الحبيبيالجيد يضمن انه من الصعب عليهم الوصول إلى باقي الأجزاءوعلاوة على ذلك فعن طريق تجزيء النظام إلى مكونات أصغر فإن مدى تعقيد المكونات الفردية يتم تخفيضها وبالتالي فتح إمكانية استخدام تقنيات مثل النظرية الآلية التي تبرهن على إثبات صحة برمجيات النظم الفرعية الحاسمة هذا يتيح حلاً ذو هيئة مغلقة للأمن الذي يعمل بشكل جيد عندما تعزل ممتلكات واحدة فقط ذات سمات جيدة على أنها في غاية الأهمية وأن الملكية هي أيضا خاضعة للتقييم من الرياضيات ليس من المستغرب أن ذلك غير عملي للصحة العامة والتي ربما لا تستطيع حتى أن تعرّف والأقل بكثير أن تثبت عندما لا تكون براهين الصحة الرسمية ممكنة فالاستخدام الصارم للقانون وفحص كل وحدة يمثل نهج ذو سعيأفضل لجعل الوحدات آمنةوينبغي للتصميم استخدام «الدفاع في العمق» حيث يوجد أكثر من نظام فرعي واحد يحتاج إلى أن ينتهك لتسوية سلامة النظام والمعلومات التي يحتفظ بها الدفاع في العمق يعمل عندما لا يوفر خرق واحد من الاجراءات الأمنية منبرا لتسهيل تخريب أجراء آخر أيضا فإن مبدأ المتتالية يقر بأن العديد من العقبات المنخفضة لا يخلق عقبة عالية ولذلك فتتالي عدة آليات ضعيفة لا يوفر سلامة آلية واحدة أقوىوينبغي أن تتخلف النظم الفرعية لتأمين الإعدادات وحيثما كان ذلك ممكنا ينبغي أن تهدف إلى «فشل آمن» بدلا من «فشل غير آمن» انظر الفشل الآمن للتعادل في هندسة السلامة من الناحية المثالية فالنظام الآمن ينبغي أن يتطلب قرارا متعمدا وواعيا وعلى دراية وحرا من جانب السلطات الشرعية لجعلها غير آمنةبالإضافة إلى ذلك لا ينبغي للأمن أن يكون قضية إما كل شيء أو لا شيء ينبغي على مصممي ومشغلي الأنظمة أن يفترضوا أن الخروقات أو الثغرات الأمنية لا مفر منهاالتدقيق الكامل للمسارات ينبغي أن يبقى من نشاط النظام حتى إذا حدث خرق أمني فآلية الخرق ومداه يمكن تحديدهما تخزين مراجعة المسارات عن بعد حيث لا يمكن إلا اللحاق بها يمكنها أن تبقي المتسللين من تغطية مساراتها أخيرا فالكشف الكامل يساعد على ضمان أنه عندما يتم العثور على الخلل فإنه يتم الاحتفاظ ب «نافذة الضعف» لأقصر قدر ممكننظام التشغيل مالتيكس البدائي كان لافتا لتركيزه المبكر على أمن الحاسوب حسب التصميم وربما كان مالتيكس النظام التشغيلي الأول ليصمم على شكل نظام آمن من الألف إلى الياء وعلى الرغم من هذا فقد خرق أمن مالتيكس ليس مرة واحدة ولكن بشكل متكرر والاستراتيجية كانت تعرف باسم اختراق واختبار وأصبحت معروفة على نطاق واسع باعتبارها عملية غير منتهية فشلت في إنتاج أمن الحاسوب وأدى هذا إلى مزيد من العمل بشأن أمن الحاسوب الذي استبق تصورات التقنيات الهندسية الأمنية الحديثة المنتجة لشكل مغلق من العمليات التي تنهي عند اختراق الحاسوببداية ظهورهيمكن تعريف البنية الأمنية بأنها التصميم الصناعي الذي يصف كيفية وضع الضوابط الأمنية التدابير الأمنية المضادة وكيفية ارتباطها بالبنية الكلية لتكنولوجيا المعلومات هذه الضوابط تخدم غرض الحفاظ على السمات النوعية للنظام من بينها السرية والسلامة والتوافر والمساءلة والضمانوالهيكل الأمني هو الخطة التي يظهر فيها أين يجب أن توضع التدابير الأمنية إذا كانت الخطة تصف حل محدد فإنه قبل بناء مثل هذه الخطة من شأن المصمم أن يقوم بتحليل المخاطر إذا كانت الخطة وصفا لتصميم عام وعلى مستوى عال الهيكل المرجعي فينبغي أن تستند الخطة إلى تحليل التهديدأمن الحاسوب القائم أو المساعد من قبل الأجهزة hardware يوفر بديلا لأمن الحاسوب للبرامج الإلكترونية فقط softwareonly الأجهزة مثل دونجل يمكن أن تعتبر أكثر أمانا لأن الوصول المادي مطلوب من أجل أن يتعرض للخطرفي حين أن العديد من الحلول الأمنية القائمة على البرمجيات software based تقوم بتشفير البيانات لمنع البيانات من السرقة فإن أي برنامج ضار أو القراصنة قد يعطبون البيانات في النظام لجعلها غير قابلة للاسترداد أو غير صالحة للاستعمال وبالمثل يمكن أن تفسد أنظمة التشغيل التي تكون مشفرة بواسطة برنامج ضار أو القراصنة مما يجعل النظام غير قابل للاستخدام الحلول الأمنية القائمة على الأجهزة Hardwarebased يمكن أن تمنع الوصول إلى البيانات من خلال القراءة والكتابة وبالتالي توفر حماية قوية جدا من التلاعب والوصول غير المصرح بهعمل الأمن القائم على الأجهزة الجهاز يسمح للمستخدم بتسجيل الدخول والخروج ووضع مستويات امتياز مختلفة عن طريق العمل اليدوي يستخدم الجهاز تقنية المقاييس الحيوية لمنع المستخدمين المتطفلين من تسجيل الدخول وتسجيل الخروج وتغيير مستويات الامتياز الحالة الراهنة لمستخدم الجهاز تُقرَئ عن طريق كل من جهاز الحاسوب وأجهزة التحكم في الأجهزة الطرفية مثل الأقراص الصلبة الوصول غير المشروع من قبل المتطفلين أو البرنامج الضار يقطع استنادا إلى الحالة الراهنة للمستخدم من قبل وحدات تحكم القرص الصلب وقرص الفيديو الرقمي مما يجعل الوصول غير المشروع إلى البيانات مستحيلا مراقبة الدخول القائم على الأجهزة هو أكثر أمنا من تسجيل الدخول وتسجيل الخروج باستخدام نظم التشغيل لأن نظم التشغيل عرضة للهجمات الخبيثة بما أن البرمجيات لا يمكنها التلاعب بمستويات الامتياز للمستخدم فمن المستحيل على أي متسلل أو برنامج ضار الوصول إلى البيانات المُؤمّنة التي تحميها الأجهزة أو تنفيذ عمليات امتياز غير مصرح بها الأجهزة تحمي صورة نظام التشغيل وملف النظام من الامتيازات من العبث ولذلك يمكن إنشاء نظام آمن تماما باستخدام مجموعة من الأمن القائم على الأجهزة وسياسات الأمن الخاصة بإدارة النظامواحد من استخدامات مصطلح أمن الحاسوب يشير إلى التكنولوجيا المستخدمة لتنفيذ نظام تشغيل آمن الكثير من هذه التكنولوجيا مبني على أساس العلوم التي تقدمت منذ 1980 وتستخدم لإنتاج ما يمكن أن يكون بعضا من أكثر أنظمة التشغيل التي لا يمكن اختراقها قبل أي وقت مضى وإن كانت لا تزال سارية المفعول فالتكنولوجيا ذات استخدام محدود اليوم في المقام الأول لأنه يفرض بعض التغييرات على إدارة النظام وأيضا لأنها ليست مفهومة بشكل واسع فمثل هذه الأنظمة التشغيلية القوية جدا والآمنة تستند إلى قناة نظام التشغيل التكنولوجية التي يمكنها أن تضمن أن بعض السياسات الأمنية تفرض بشكل مطلق في بيئة التشغيل مثال على هذه السياسة الحاسوبية الأمنية هو التحكم بوصول إلزامي الاستراتيجية تقوم على اقتران السمات الخاصة للمعالجات الدقيقة للأجهزة وغالبا ما تنطوي على وحدة إدارة الذاكرة مع قناة نظام التشغيل خاصة ومنفّذَة بشكل صحيح وهذا يشكل الأساس لنظام تشغيل آمن والذي إذا صُممت بعض أجزائه الحرجة ونُفذت بشكل صحيح فإنه يمكن أن تضمن استحالة مطلقة ضد الاختراق من قبل عناصر معادية هذه القدرة تُخوّل لأن التكوين لا يفرض السياسة الأمنية فحسب ولكن من الناحية النظرية تحمي نفسها من الفساد تماما أنظمة التشغيل العادية من ناحية أخرى تفتقر إلى السمات التي تؤكد على هذا المستوى الأقصى للأمن منهجية التصميم لإنتاج مثل هذه الأنظمة الآمنة دقيقة وحتمية ومنطقيةالأنظمة المصممة مع مثل هذه المنهجية تمثل حالة فن أمن الحاسوب على الرغم من أن المنتجات التي تستخدم هذا النوع من الأمن ليست معروفة على نطاق واسع وفي تناقض حاد مع معظم أنواع البرمجيات فأنها مطابقة للمواصفات مع اليقين إنه يمكن التحقق منها وفقا لمواصفات مماثلة للحجم والوزن والقوة أنظمة التشغيل الآمنة المصممة بهذه الطريقة تستخدم أساسا لحماية الأمن القومي للمعلومات والأسرار العسكرية والبيانات من المؤسسات المالية الدولية هذه أدوات أمنية قوية جدا وعدد قليل جدا من أنظمة التشغيل الآمنة صدقت على أعلى مستوى الكتاب البرتقالي أ 1 لتعمل على مجموعة من «سري جدا» إلى «غير مصنف» بما في ذلك Honeywell وSCOMP و USAF و SACDIN و NSA Blacker وشبكة Boeing MLS وضمان الأمن لا يتوقف فقط على سلامة إستراتيجية التصميم ولكن أيضا على التأكد من صحة التنفيذ وبالتالي هناك درجات من القوة الأمنية المحددة لCOMPUSEC والمعايير العامة تحدد القوة الأمنية للمنتجات من حيث عنصرين وظائف الأمن ومستوى الضمان مثل اختبار مستويات تقييم الضمان EAL وهذه محددة في ملف حماية للمتطلبات وللهدف الأمني لمواصفات المنتجات لا أحد من هذه الأنظمة التشغيلية فائقة الضمان الآمنة المستخدمة للأغراض العامة تم إنتاجها لعقود أو تم اعتمادها بموجب المعايير المشتركةفي لغة الولايات المتحدة الأمريكية فإن مصطلح التأمين العالي عادة ما يشير إلى أن النظام لديه مهام الأمن الصحيحة والتي يتم تنفيذها بقوة كافية لحماية المعلومات السرية لوزارة الدفاع ووزارة الطاقة الضمان المتوسط يشير إلى أنه يمكنه حماية المعلومات الأقل قيمة مثل معلومات ضريبة الدخل أنظمة التشغيل الآمنة المصممة لتلبية مستويات متوسطة الشدة من وظائف الأمن والضمان شهدت استخدامها على نطاق أوسع داخل كل من الحكومة والأسواق التجارية النظم متوسطة الشدة قد توفر نفس الوظائف الأمنية التي توفرها أنظمة التشغيل الآمنة عالية الضمان ولكنها تفعل ذلك بمستوى ضمان أدنى مثل مستويات المعايير المشتركة EAL4 أو EAL5 مستويات أدنى تعني أننا نكون أقل تأكدا أن تنفيذ المهام الأمنية لا تشوبه شائبة وبالتالي يقل الاعتماد عليها هذه الأنظمة موجودة في استخدامها على خوادم الشبكة العنكبوتية والحراس وخوادم قاعدة البيانات ومضيفي الإدارة ولا تستخدم فقط لحماية البيانات المخزنة على هذه الأنظمة ولكن أيضا لتوفير مستوى عال من الحماية لشبكة الاتصالات وخدمات التوجيهإذا كانت بيئة العمل لا تستند إلى نظام تشغيل آمن قادر على الحفاظ على مجال لتنفيذه الخاص وقادر على حماية رموز التطبيقات من التخريب الخبيث وقادر على حماية النظام من الرموز المدمرة فإن الدرجات العالية من الأمن غير ممكنة لأسباب مفهومة في حين أن مثل هذه الأنظمة التشغيلية الآمنة ممكنة وتم تنفيذها فمعظم النظم التجارية تقع في فئة «الأمن المنخفض» لأنها تعتمد على ميزات غير معتمدة من قبل أنظمة التشغيل الآمنة مثل النقل إلخ في بيئات التشغيل المنخفضة الأمن يجب أن يعتمد على التطبيقات للمشاركة في حماية أنفسها هناك ممارسات ترميز آمنة ذات جهدأفضل  يمكن اتباعها لجعل التطبيق أكثر مقاومة للتخريب الخبيثفي البيئات التجارية فإن الغالبية من خروقات تخريب البرمجيات تنتج من أنواع قليلة معروفة من عيوب الترميز عيوب عامة للبرامج تشمل الهشاشة فيض الدارئ وخروقات سلسلة البناء تجاوز العدد الصحيح وبرمجة بالحقنبعض اللغات الشائعة مثل C و C  عرضة لجميع هذه العيوب انظر سيكورد «الترقيم المؤمن في C و C» لغات أخرى مثل جافا أكثر مقاومة لبعض هذه العيوب ولكنها لا تزال عرضة لأوامر رمز  حقن وغيرها من عيوب البرمجيات التي تسهل التخريبفي الآونة الأخيرة فإن ممارسة ترميز سيئة آخرى قد خضعت للتمحيص المؤشرات المعلقة الاستغلال المعروف الأول لهذه المشكلة بالذات قدم في تموز  يوليو 2007 قبل نشر هذه المشكلة فإنها كانت معروفة لكنها اعتبرت أنها أكاديمية ولا يمكن استغلالها عملياباختصار يمكن لالترميز الآمن أن يوفر ثمنا كبيرا في بيئات التشغيل المنخفضة الأمن وبالتالي يستحق كل هذا الجهد لا تزال لا توجد طريقة معروفة لتوفير درجة موثوقة من مقاومة التخريب بأي درجة أو مزيج من الترميز الآمنضمن أنظمة الحاسوب فهناك نموذجي أمن قادرين على فرض انفصال للامتياز وهما قوائم التحكم بالوصول ACLs والقدرات دلالات ACLs أُثبت انعدام أمنها في كثير من الحالات على سبيل المثال مشكلة خلط التفويض وقد تبين أيضا أن ما وعد ال ACLs به بإعطاء الوصول إلى الكائن لشخص واحد فقط لا يمكن ضمانه أبدا في الممارسة العملية كل من هذه المشاكل يتم حلها من خلال القدرات هذا لا يعني وجود عيوب عملية بجميع النظم القائمة على ACL ولكن فقط ان المصممين لمرافق معينة يجب أن يتحملوا المسؤولية لضمان أن لا يعرضوا عيوباالقدرات تقتصر في الغالب على نظم التشغيل المخصصة للبحوث أما نظم التشغيل التجارية لا تزال تستخدم ACLs يمكن للقدرات على الرغم من ذلك أن تنفذ على مستوى اللغة مما يؤدى إلى أسلوب برمجة في جوهره صقل لتصميم معياري لتوجهكائن المشروع مفتوح المصدر في المنطقة هو لغة Eأولا نظام بليسسي 250 ثم حاسوب كامبردج كاب برهنا على استخدام القدرات سواء في الأجهزة أوالبرمجيات في السبعينات من القرن العشرين أحد الأسباب لعدم تبني القدرات أن ACLs ربما يبدو أنها قدمت حل سريع للأمن من دون إعادة تصميم متفشي لنظام التشغيل والأجهزةأجهزة الحاسوب الأكثر أمانا هي تلك التي لا علاقة لها بشبكة الإنترنت وبمنأى عن أي تدخل في العالم الحقيقي فمعظم الأمن يأتي من نظام التشغيل حيث الأمن لا يشكل إضافة نوعية مثل OS400 من آي بي إمو هذا تقريبا لم يظهر في قوائم نقاط الضعف لسبب وجيه قد تمر سنوات بين المشكلة الواحدة التي تحتاج إلى علاج والمشكلة التاليةراجع مقالة أنظمة التشغيل الآمنةأمن الحاسوب أمر حاسم في ما يقرب أي صناعة تعتمد على التكنولوجيا التي تعمل على أنظمة الحاسوبيمكن أيضا أن يشار إلى أمن الحاسوب بسلامة الحاسوب قضايا النظم المعتمدة على الحاسوب ومعالجة أوجه الضعف التي لا تعد ولا تحصى هي جزء لا يتجزأ من الحفاظ على الصناعة التنفيذيةلصناعة الطيران أهمية خاصة عند تحليل أمن الحاسوب بسبب المخاطر التي تنطوي عليها الحياة البشرية وتشمل المعدات غالية الثمن والبضائع والبنية التحتية للنقل يمكن أن يتعرض الأمن للخطر بسبب سوء تصرف الأجهزة والبرمجيات والخطأ البشري وبيئات التشغيل الخاطئ والتهديدات التي تستغل الثغرات الحاسوبية يمكن أن تنبع من التخريب والتجسس والمنافسة الصناعية والهجوم الإرهابي والعطل الميكانيكي والخطأ البشريالآثار المترتبة على سوء الاستخدام الناجح المتعمد أو غير المتعمد لنظام الحاسوب في صناعة الطيران يمتد من فقدان السرية لفقدان سلامة النظام مما قد يؤدي إلى مزيد من المخاوف الخطيرة مثل سرقة أو ضياع البيانات وانقطاع مراقبة الشبكة والحركة الجوية والذي بدوره يمكن أن يؤدي إلى إغلاق المطار وفقدان الطائرة والخسائر في أرواح الركاب ونظم التحكم في الذخائر العسكرية يمكن أن تشكل مخاطر أكبروالهجوم السليم لا يحتاج إلى أن يكون عالي جدا تكنولوجيا أو ممولا تمويلا جيدا  فانقطاع التيار الكهربائي في المطار وحده يمكن أن يسبب مضاعفات في جميع أنحاء العالم واحدة من أسهل السبل ويمكن القول الأكثر صعوبة في تتبع الثغرات الأمنية يمكن تحقيقها من خلال إرسال الرسائل غير المصرح بها عبر ترددات راديو محددة هذا الإرسال قد يحاكي محاكاة ساخرة مراقبي الحركة الجوية أو ببساطة يعطل الاتصالات كليا هذه الحوادث شائعة جدا بعد أن غيرت من دوران طيران الطائرات التجارية وسببت حالة من الذعر والارتباك في الماضي السيطرة على الطائرات فوق المحيطات خطير للغاية لأن المراقبة بالرادار فقط تمتد من 175 حتى 225 ميلا بحريا من الشاطئ فبالتالي خارج مجال الرادار فالتحكم يجب أن يعتمد على الاتصالات اللاسلكية الدورية مع طرف ثالثالبرق وتذبذب التيار الكهربائي والأعاصير والبني التدريجي والصمامات المنفجرة وغيرها من مختلف انقطاعات التيار الكهربائي التي تعطل على الفور جميع أنظمة الحاسوب نظرا لأنها تعتمد على مصدر كهربائي أخطاء عرضية وعمدية أخرى تسببت في اضطراب كبير لنظم السلامة الحيوية طوال العقود القليلة الماضية والاعتماد على اتصالات موثوقة وتوليد الطاقة الكهربائية يعرض سلامة الحاسوب للخطر فقطفي عام 1994 حدثت أكثر من مائة عملية اقتحام من قبل قراصنة مجهولين في مختبر روما ومركز الأمر الرئيسي في سلاح الجو الأميركي وفي مركز الأبحاث باستخدام فيروسات حصان طروادة تمكن المتسللون من الحصول على وصول غير مقيد إلى أنظمة شبكات روما وإزالة آثار أنشطتهم كان المتسللون قادرين على الحصول على ملفات سرية مثل بيانات نظم تسلسل المهام الجوية وعلاوة على ذلك قادرين على اختراق الشبكات المتصلة للملاحة الجوية الوطنية وإدارة مركز غودارد للطيران الفضائي وقاعدة رايت باترسون للقوات الجوية وبعض مقاولي وزارة الدفاع وغيرها من القطاعات الخاصة من خلال التنكر كمستخدم موثوق في مركز روماالآن تستخدم تقنية تسمى اختبار الاختراق الأخلاقي لإصلاح هذه القضاياالتداخل الكهرومغناطيسي هو تهديد آخر لسلامة الحاسوب وفي عام 1989 أسقطت طائرة تابعة للولايات المتحدة للقوات الجوية طراز اف 16 سهوا قنبلة تبلغ 230 كيلوغراما في غرب جورجيا بعد تدخل غير محدد تسبب في إطلاق أجهزة الحاسوب في الطائرة لهاوهناك حادثة اتصالات سلكية ولاسلكية مماثلة كما حدث في عام 1994 عندما دمرت اثنتان من طائرات يو اتش 60 بلاك هوك من قبل طائرات اف 15 في العراق لأن نظام الآي ف ف لنظام التشفير أصيب بعطبالمصطلحات التالية مستخدمة في هندسة نظم آمنة وهي موضحة أدناهيمكن أن تستخدم تقنيات المصادقة لضمان التحقق أن نقاط اتصالات هم من يقولون انهم همإثبات النظرية الآلية وأدوات التحقق الأخرى يمكنها تمكين الخوارزميات الحرجة والرموز المستخدمة في النظم الآمنة أن تثبت رياضيا لتلبية المواصفاتيمكن استخدام تقنيات القدرة وقوائم السيطرة على الدخول لضمان انفصال الامتياز وإلزامية مراقبة الدخول والمقاطع التالية تناقش استخداماتهايمكن استخدام تقنيات سلاسل الثقة لمحاولة ضمان أن تكون جميع البرامج المحملة قد تم المصادقة على أصالتها من قبل المصممينيمكن استخدام تقنيات التشفير للدفاع عن البيانات العابرة بين النظم والحد من احتمال أن تكون البيانات المتبادلة بين النظم يتم اعتراضها أو تعديلهاجدران الحماية يمكنها أن توفر بعض الحماية من التطفل القادم من الإنترنتويمكن استخدام التحكم الإلزامي في الوصول لضمان سحب الوصول المميز عندما يتم إبطال الامتيازات على سبيل المثال حذف حساب المستخدم يجب أيضا أن يوقف أي العمليات التي تجري مع امتيازات المستخدميمكن استخدام معالجات التشفير الآمنة للاستفادة من التقنيات الأمنية المادية في حماية أمن نظام الحاسوبيمكن الاعتماد على القنوات الصغيرة في مواجهة الأخطاء  وعلى سبيل المثال EROS و Coyotosبرمجيات أمن نقاط النهاية يساعد الشبكات في منع سرقة البيانات والعدوى بالفيروس من خلال أدوات التخزين النقالة مثل أقراص اليو أس بيبعض البنود التالية قد تنتمي إلى مقالة انعدام أمن الحاسوب إذن الوصول يقيّد الوصول إلى جهاز حاسوب لمجموعة من المستخدمين من خلال استخدام نظم التوثيق هذه النظم يمكنها أن تحمي إما الحاسوب بأكمله—مثل شاشة تفاعلية لتسجيل الدخول—أو الخدمات الفردية مثل خادم بروتوكول نقل الملفات هناك أساليب كثيرة لتحديد وتوثيق المستخدمين مثل كلمة السر وبطاقة الهوية ومؤخرا البطاقة الذكية ونظم التحقق من الهويةالبرمجيات المضادة للفيروسات تتكون من برامج الحاسوب التي تحاول تحديد وإحباط والقضاء على فيروسات الحاسوب وغيرها من البرامج الضارةينبغي عدم تشغيل التطبيقات ذات العيوب الأمنية المعروفة إما اتركها مطفأة حتى يمكن أن تصحح أو ترقع أو احذفها واستبدلها ببعض التطبيقات الأخرى العيوب المعروفة علنا هي الدخول الرئيسي الذي تستخدمها الديدانلاقتحام النظام تلقائيا والانتشار بعد ذلك إلى النظم الأخرى المرتبطة بها موقع الأمن Secunia يوفر أداة للبحث عن عيوب غير مثبتة في المنتجات الشعبيةالنسخ الاحتياطية تعتبر هي وسيلة لتأمين المعلومات بل هي نسخة أخرى من كل الملفات المهمة على الحاسوب تبقى في مكان آخر هذه الملفات تحفظ على الأقراص الصلبة والأقراص القابلة للقراءة فقط والأقراص القابلة للقراءة والكتابة والأشرطة مواقع مقترحة لتخزين النسخ الاحتياطية هي الخزنات المضادة للحريق والماء والحرارة أو في ملف منفصل بعيدا عن الموقع من ذلك الذي يحتوي الملفات الاصلية بعض الأفراد والشركات أيضا يبقون النسخ الاحتياطية في صناديق ودائع آمنة داخل قبو المصرف وهناك أيضا خيار رابع والذي ينطوي على استخدام واحد من الملفات المجانية التي تدعم الملفات عبر الإنترنت لقطاع الأعمال والأفراد على حد سواءالنسخ الاحتياطية مهمة أيضا لأسباب أخرى غير الأمن فالكوارث الطبيعية مثل الزلازل والأعاصير أو الزوابع قد تضرب المبنى حيث يوجد الحاسوب ويمكن أن يحترق البناء أو قد يحدث انفجار فيجب أن يكون هناك نسخة احتياطية حديثة في مكان آمن بديل في حالة حدث من هذا النوع من الكوارث كذلك فمن المستحسن أن يوضع في موقع بديل بحيث لن تؤثر نفس الكارثة على كلا الموقعين أمثلة على مواقع بديلة للتعافي من الكوارث والتي تعرضت للخطر من جراء الكارثة نفسها التي أثرت على الموقع الأساسي تشمل ان كان الموقع الأساسي في مركز التجارة العالمي الأول واسترداد الموقع في 7 مركز التجارة العالمي وكلاهما قد دمر في هجوم 9  11 ووضع كلا الموقع الرئيسي وموقع الإنعاش في المنطقة الساحلية نفسها الأمر الذي يؤدي إلى تعرضهما للضعف من الاضرار التي تلحقها الاعاصير على سبيل المثال الموقع الأساسي في نيو أورليانز واسترداد الموقع في جيفرسون باريش وكلاهما تم ضربها من اعصار كاترينا في عام 2005 وسائط النسخ الاحتياطي ينبغي أن تنقل بين المواقع الجغرافية بطريقة آمنة وذلك لمنعهم من السرقةيستخدم التشفير لحماية الرسالة من عيون الآخرين ويمكن القيام به في عدة طرق عن طريق تحويل الحروف حول بعضها واستبدال الحروف مع بعضها وحتى إلغاء بعض الحروف من الرسالة هذه يجب أن تستخدم في تركيبة لجعل التشفير آمن بما فيه الكفاية وهذا يعني من الصعب بما فيه الكفاية للتصدع والتكسر تشفير المفتاح العام هو سبيل مصقول وعملي للقيام بالتشفير أنها تسمح لأي شخص مثلا بكتابة رسالة للحصول على قائمة المستفيدين وفقط أولئك المستفيدون سوف يكونون قادرين على قراءة تلك الرسالةالجدران النارية هي النظم التي تساعد على حماية أجهزة الحاسوب وشبكات الحاسوب من الهجوم والاقتحام المتتابع عن طريق تقييد حركة مرور الشبكة التي يمكن أن تمر من خلالها استنادا إلى مجموعة قواعد محددة من المسؤول عن النظامأواني العسل عبارة عن أجهزة حاسوب تركت عرضة للهجوم إما عن قصد أو عن غير قصد من قبل المتسللين ويمكن أن تستخدم لصيد المتسللين أو تحديد نقاط الضعفنظم كشف التسلل يمكنها تفحص الشبكة للناس الموجودين على الشبكة ولكن الذين لا ينبغي لهم أن يكونوا هناك أو يفعلون أشياء لا ينبغي لهم أن يفعلوها على سبيل المثال محاولة الكثير من كلمات السر للوصول إلى الشبكةويتم استخدام تطبيق أزيز الأزة من قبل المخترقين المحتملين لإيجاد ما إذا كان عنوان بروتوكول الإنترنت قابلا للوصول إذا وجد المخترق حاسوبا فإنه يحاول الفحص للكشف عن منفذ لإيجاد والهجوم على الخدمات على هذا الحاسوبالوعي الهندسي الاجتماعي يبقي الموظفين على بينة من مخاطر الهندسة الاجتماعية و أو الأماكن التي لديها سياسة لمنع الهندسة الاجتماعية يمكن أن تقلل من الانتهاكات الناجحة للشبكة والخوادممراصد ملف النزاهة هي الأدوات المستخدمة للكشف عن التغيرات في نزاهة النظم والملفات",
    "score":8
  },
  {
    "title": "هجوم سيبراني",
    "article": "تعديل  تعديل مصدري  تعديل ويكي بياناتالهجوم السيبراني بالإنجليزية cyberattack‏ في أجهزة الحاسوب أي هجوم هو يعتبر محاولة لفضح أو تغيير أو تعطيل أو تدمير أو سرقة أو الحصول على وصول غير مصرح به أو استخدام غير مصرح به للأصول1 الهجوم السيبراني أو «الهجوم الإلكتروني» هو أي نوع من المناورة الهجومية التي تستهدف أنظمة معلومات الكمبيوتر أو البنية التحتية أو شبكات الكمبيوتر أو أجهزة الكمبيوتر الشخصية المهاجم هو شخص أو عملية تحاول الوصول إلى البيانات أو الوظائف أو المناطق المحظورة الأخرى في النظام دون الحصول على إذن ويحتمل أن يكون ذلك بقصد ضار2 اعتمادًا على السياق يمكن أن تكون الهجمات الإلكترونية جزءًا من الحرب الإلكترونية أو الإرهاب الإلكتروني يمكن استخدام الهجوم الإلكتروني من قِبل دول ذات سيادة أو أفراد أو مجموعات أو مجتمع أو منظمات أو حتى عصابات وقد تنشأ هذه الهجمات الإلكترونية لسيبرانية من مصدر مجهولقد يسرق الهجوم الإلكتروني هدفًا محددًا أو يغيره أو يدمره عن طريق اختراق نظام حساس3 يمكن أن تتراوح الهجمات الإلكترونية بين تثبيت برامج التجسس على جهاز كمبيوتر شخصي ومحاولة تدمير البنية التحتية لدول بأكملها يسعى الخبراء القانونيون إلى قصر استخدام المصطلح على الحوادث التي تسبب أضرارًا جسدية وتمييزه عن خروقات واختراقات البيانات الروتينية وأنشطة القرصنة الأوسع نطاقًا4أصبحت الهجمات الإلكترونية معقدة وخطيرة على نحو متزايد5يمكن استخدام تحليلات سلوك المستخدم و SIEM للمساعدة في منع هذه الهجماتمنذ أواخر الثمانينيات من القرن الماضي تطورت الهجمات الإلكترونية عدة مرات لاستخدام الابتكارات في تكنولوجيا المعلومات كمتجهات لارتكاب جرائم الإنترنت في السنوات الأخيرة ازداد حجم وقوة الهجمات السيبرانية بشكل سريع كما لاحظ المنتدى الاقتصادي العالمي في تقريره لعام 2018 «القدرات السيبرانية الهجومية تتطور بسرعة أكبر من قدرتنا على التعامل مع الحوادث العدائية» 6في شهر أيار  مايو من عام 2000 عرّفت فرقة هندسة الإنترنت للهجوم في rfc2828 RFC 2828 على النحو التاليتعريف CNSS رقم 4009 بتاريخ يوم 26 بشهر أبريل في عام 2010 من قبل لجنة أنظمة الأمن القومي بالولايات المتحدة الأمريكية 7 يُعرّف الهجوم بأنهأدى الاعتماد المتزايد للمجتمع الحديث على شبكات المعلومات والحواسيب سواء في القطاعين العام والخاص بما في ذلك الجيش 8910 إلى مصطلحات جديدة مثل الهجوم السيبراني والحرب الإلكترونية تعريف CNSS التعليمات رقم 4009 7 يُعرّف الهجوم السيبراني على النحو التاليسنة 2017 كانت تعتبر سنة سيئة السمعة في عالم البيانات وهجمات الإنترنت حيث أن في الأشهر الستة الأولى من عام 2017 سُرق أو تأثر ملياري سجل بيانات بسبب الهجمات الإلكترونية وبلغت مدفوعات الفدية 2 billion دولار أمريكي  أي ضعف ذلك في عام 201611تستخدم Cyberwarfare وهي تعني بال«حرب الإلكترونيةالسيبرانية» تقنيات الدفاع عن شبكات المعلومات والحواسيب ومهاجمتها التي تقطن الفضاء الإلكتروني غالبًا من خلال حملة إلكترونية مطولة أو سلسلة من الحملات ذات الصلة إنها تتنكر قدرة الخصم على فعل الشيء نفسه مع استخدام أدوات الحرب التكنولوجية لمهاجمة أنظمة الكمبيوتر الحاسمة للخصم الإرهاب السيبرانيالإلكتروني من ناحية أخرى هو «استخدام أدوات شبكات الكمبيوتر لإغلاق البنى التحتية الوطنية الحيوية مثل الطاقة أو النقل أو العمليات الحكومية أو لإكراه أو تخويف حكومة أو سكان مدنيين»12 وهذا يعني أن النتيجة النهائية لكل من الحرب الإلكترونية والإرهاب السيبراني هي نفسها لتدمير البنى التحتية الحيوية وأنظمة الكمبيوتر المرتبطة ببعضها البعض داخل حدود الفضاء الإلكترونيهناك ثلاثة عوامل تسهم في سبب شن الهجمات الإلكترونية ضد دولة أو فرد عامل الخوف العامل الدراماتيكي وعوامل الضعفالعامل الدراماتيكي أو «العامل المدهش» هو مقياس للضرر الفعلي الناجم عن الهجوم وهذا يعني أن الهجوم يخلق خسائر مباشرة عادة ما يكون فقدان التوافر أو فقدان الدخل ويحصل على دعاية سلبية في يوم 8 من شهر فبراير بعام 2000 أدى هجوم رفض الخدمة إلى انخفاض حاد في عدد الزيارات إلى العديد من المواقع الرئيسية بما في ذلك Amazon و Buycom و CNN و eBay استمر الهجوم في التأثير على مواقع أخرى في اليوم التالي13 تشير التقارير إلى أن شركة أمازون قدرت خسارة الأعمال بمبلغ 600000 دولاريستغل عامل الضعف مدى تعرض منظمة أو مؤسسة حكومية للهجمات الإلكترونية قد تعمل المؤسسات التي لا تحتوي على أنظمة صيانة على خوادم قديمة تكون أكثر عرضة للتأثر من الأنظمة المحدثة يمكن أن تكون المؤسسة عرضة لهجوم الحرمان من الخدمة ويمكن تشويه مؤسسة حكومية على صفحة ويب يؤدي هجوم شبكة الكمبيوتر إلى تعطيل سلامة أو صحة البيانات عادةً من خلال تعليمات برمجية ضارة تعمل على تغيير منطق البرنامج الذي يتحكم في البيانات مما يؤدي إلى حدوث أخطاء في الإخراج14يمكن للمتطفلين المحترفين سواء كانوا يعملون بمفردهم أو يعملون لدى الوكالات الحكومية أو الجيش العثور على أنظمة كمبيوتر بها نقاط ضعف تفتقر إلى برنامج الأمان المناسب بمجرد العثور على هذه الثغرات الأمنية يمكنها أن تصيب الأنظمة برمز خبيث ثم تتحكم عن بعد في النظام أو الكمبيوتر عن طريق إرسال أوامر لعرض المحتوى أو لتعطيل أجهزة الكمبيوتر الأخرى يجب أن يكون هناك خلل في النظام موجود مسبقًا داخل الكمبيوتر لكي تكون الهجمة الإلكترونية قد تمت بالنجاح مثل عدم وجود حماية ضد الفيروسات أو تكوين نظام معيب لكي يعمل الرمز الفيروسيسيقوم العديد من المتسللين المحترفين بترويج أنفسهم للإرهابيين عبر الإنترنت حيث تحكم مجموعة جديدة من القواعد تصرفاتهم الإرهابيون الإلكترونيون لديهم خطط متعمدة ولا تولد هجماتهم من الغضب ولكن أيضاً يحتاجون مثل هؤلاء إلى تطوير خططهم خطوة بخطوة والحصول على البرنامج المناسب لتنفيذ هجومهم الإلكتروني السيبراني عادة ما يكون لديهم جداول أعمال سياسية وتستهدف الهياكل السياسية الإرهابيون الإلكترونيون هم قراصنة لديهم دوافع سياسية ويمكن أن تؤثر هجماتهم على الهيكل السياسي من خلال هذا الفساد والدمار كما أنها تستهدف المدنيين والمصالح المدنية والمنشآت المدنية كما ذكر سابقًا يهاجم الإرهابيون الإلكترونيون الأشخاص أو الممتلكات ويتسببون في أضرار كافية لتوليد الخوف وزعزعة أمن بعض الكياناتيمكن أن يكون الهجوم نشطًا أو غير نشطاًيمكن أن يُرتكب ويُفتعل الهجوم من قبل شخص من الداخل داخل المؤسسة المقصود الهجوم عليها أو من خارج المؤسسة يتعلق مصطلح «الهجوم» ببعض مصطلحات الأمان الأساسية الأخرى كما هو موضح في الرسم البياني التالي  يمكن أن يكون للمورد سواءً ماديًا أو منطقيًا الذي يُطلق عليه مادة العرض ثغرة واحدة أو أكثر يمكن استغلالها بواسطة عامل تهديد في إجراء تهديدي نتيجة لذلك قد تتعرض سرية أو سلامة أو توفر الموارد للخطر من المحتمل أن يمتد الضرر إلى الموارد بالإضافة إلى الموارد التي تم تحديدها مبدئيًا على أنها ضعيفة بما في ذلك موارد المنظمة الأخرى وموارد الأطراف المعنية الأخرى العملاء والموردينما يسمى ثالوث CIA هو أساس أمن المعلوماتيمكن أن يكون الهجوم نشطًا عندما يحاول تغيير موارد النظام أو التأثير على تشغيلها لذا فإنه يهدد النزاهة أو التوفر لنظام أمن المعلومات يحاول «الهجوم الغير نشط» تعلم المعلومات من النظام أو الاستفادة منها لكنه لا يؤثر على موارد النظام لذا فهو يهدد معيار السرية لنظام أمن المعلوماتيمثل التهديد احتمالًا لانتهاك الأمن والذي يحدث عندما يكون هناك ظرف أو قدرة أو إجراء أو حدث قد ينتهك الأمن ويسبب ضرراً أي أن التهديد خطر محتمل قد يستغل ثغرة أمنية يمكن أن يكون التهديد إما «مقصودًا» أي ذكي على سبيل المثال جهاز تكسير فردي أو منظمة إجرامية أو «عرضي» على سبيل المثال احتمال حدوث خلل في جهاز الكمبيوتر أو احتمال «تصرف طبيعي غير مقصود» مثل زلزال حريق أو إعصار أو أي تصرف كارثي من الكوارث الطبيعيةتم تطوير مجموعة من السياسات المتعلقة بإدارة أمن المعلومات وهي أنظمة إدارة أمن المعلومات ISMS لإدارة الإجراءات المضادة وفقًا لمبادئ إدارة المخاطر من أجل تحقيق إستراتيجية أمنية تم وضعها وفقًا للقواعد واللوائح السارية في كل بلد15يجب أن يؤدي الهجوم إلى حادث أمني أي حدث أمني ينطوي على انتهاك أمني  بمعنى آخر حدث نظام مرتبط بالأمان يتم فيه عصيان سياسة أمان النظام أو خرقهاتمثل الصورة الكلية عوامل الخطر في سيناريو المخاطرة16يجب على المنظمة اتخاذ خطوات للكشف عن الحوادث الأمنية وتصنيفها وإدارتها تتمثل الخطوة المنطقية الأولى في إعداد خطة للاستجابة للحوادث وفي النهاية فريق للاستجابة لحالات الطوارئ بالكمبيوتر من أجل اكتشاف الهجمات يمكن إعداد عدد من التدابير المضادة على المستويات التنظيمية والإجرائية والتقنية ومن الأمثلة على ذلك فريق الاستجابة للطوارئ بالكمبيوتر ونظام تدقيق أمن تكنولوجيا المعلومات ونظام كشف التسلل17عادةً ما يتم ارتكاب الهجوم من قِبل شخص ذي نوايا سيئة وخبيثة حيث أن تقع الهجمات التي مبينة على كره السود في هذه الفئة أيضاً في حين يقوم الآخرون بإجراء اختبارات الاختراق على نظام معلومات المؤسسة لمعرفة ما إذا كانت جميع عناصر التحكم المتوقعة موجودةيمكن تصنيف الهجمات وفقًا لمصدرها الأصلي أي إذا تم إجراؤها باستخدام جهاز كمبيوتر واحد أو أكثر في الحالة الأخيرة يسمى الهجوم الموزع تستخدم Botnets لتنفيذ هجمات موزعةيتم تصنيف التصنيفات الأخرى وفقًا للإجراءات المستخدمة أو نوع الثغرات المستغلة ويمكن تركيز الهجمات على آليات الشبكة أو ميزات المضيفبعض الهجمات قد تكون جسدية أي سرقة أو تلف أجهزة الكمبيوتر وغيرها من المعدات البعض الآخر عبارة عن محاولات لفرض تغييرات في المنطق الذي تستخدمه أجهزة الكمبيوتر أو بروتوكولات الشبكة من أجل تحقيق نتيجة غير متوقعة من قبل المصمم الأصلي ولكنها مفيدة للمهاجم تسمى البرامج المستخدمة للهجمات المنطقية على أجهزة الكمبيوتر البرامج الضارةفيما يلي قائمة قصيرة جزئية بالهجماتبالتفصيل هناك عدد من التقنيات لاستخدامها في الهجمات الإلكترونية ومجموعة متنوعة من الطرق لإدارتها للأفراد أو المؤسسات على نطاق أوسع يتم تقسيم الهجمات إلى فئتين الهجمات النحوية والهجمات الدلالية الهجمات النحوية واضحة يعتبر برنامجًا ضارًا يتضمن الفيروسات والديدان وأحصنة طروادةالفيروس هو برنامج متماثل ذاتيًا يمكنه ربط نفسه ببرنامج أو ملف آخر من أجل التكاثر يمكن للفيروس أن يختبئ في أماكن غير محتملة في ذاكرة نظام الكمبيوتر ويربط نفسه بأي ملف يراه مناسبًا لتنفيذ التعليمات البرمجية الخاصة به يمكنه أيضًا تغيير بصمته الرقمية في كل مرة يتكرر فيها مما يجعل من الصعب تعقبه في جهاز الكمبيوترالدودة لا تحتاج إلى ملف أو برنامج آخر لنسخ نفسها إنه برنامج تشغيل قائم بذاته يعمل النسخ المتماثل للديدان عبر شبكة باستخدام البروتوكولات يستخدم التجسد الأخير للديدان نقاط الضعف المعروفة في الأنظمة لاختراق شفرة الشفرة وتنفيذها وتكرارها في الأنظمة الأخرى مثل دودة Code Red II التي أصابت أكثر من 259000 نظام في أقل من 14 ساعة20 على نطاق أوسع بكثير يمكن تصميم الديدان للتجسس الصناعي لمراقبة وتجميع أنشطة الخادم وحركة المرور ثم إعادة إرسالها إلى منشئهاتم تصميم حصان طروادة لأداء مهام مشروعة ولكنه يؤدي أيضًا نشاطًا غير معروف وغير مرغوب فيه أنشطة ضارة يمكن أن يكون حصان طروادة هو أساس العديد من الفيروسات والديدان التي يتم تثبيتها على جهاز الكمبيوتر مثل أجهزة تسجيل لوحة المفاتيح والبرامج الخلفية بالمعنى التجاري ويمكن دمج أحصنة طروادة في الإصدارات التجريبية من البرامج ويمكنها جمع معلومات إضافية حول الهدف دون أن يعرف الشخص حدوث ذلك من المحتمل أن يهاجم هؤلاء الثلاثة فردًا وتأسيسًا من خلال رسائل البريد الإلكتروني ومتصفحات الويب وعملاء الدردشة والبرامج عن بُعد والتحديثاتالهجوم الدلالي هو تعديل ونشر المعلومات الصحيحة وغير الصحيحة المعلومات المعدلة كان يمكن القيام بها دون استخدام أجهزة الكمبيوتر على الرغم من أنه يمكن العثور على فرص جديدة باستخدامها لتعيين شخص ما في الاتجاه الخاطئ أو لتغطية مساراتك يمكن استخدام نشر المعلومات غير الصحيحةكانت هناك حالتان من هذا القبيل بين الهند وباكستان شملت صراعات الفضاء الإلكتروني والتي بدأت في التسعينيات أصبحت الهجمات الإلكترونية السابقة معروفة منذ عام 199921 منذ ذلك الحين انخرطت الهند وباكستان في نزاع طويل الأمد بشأن كشمير حيث أنها انتقلت إلى الفضاء الإلكتروني أشارت الحسابات التاريخية إلى أن المتسللين في كل دولة شاركوا مرارًا وتكرارًا في مهاجمة نظام قاعدة بيانات الحوسبة لكل منهم زاد عدد الهجمات سنويًا 45 في عام 1999 و 133 في عام 2000 و 275 بنهاية شهر أغسطس بعام 2001 في عام 2010 قام المتسللين الهنود بشن هجوم عبر الإنترنت بمعدل على الأقل 36 موقعًا لقاعدة بيانات الحكومة باسم «الجيش السيبراني الهندي»22 في عام 2013 اخترق المتسللين الهنود الموقع الرسمي للجنة الانتخابات في باكستان في محاولة لاستعادة معلومات قاعدة البيانات الحساسة ردا على ذلك قام المتسللون الباكستانيون الذين يطلقون على أنفسهم «جيش السايبر الحقيقي» باختراق وتشويه مواقع الويب التابعة لهيئات الانتخابات الهندية والتي بلغت 1059 موقعًا23وفقًا لوسائل الإعلام تعمل باكستان على نظام فعال للأمن السيبراني في برنامج يسمى Cyber Secure Pakistan CSP24 تم إطلاق البرنامج في شهر أبريل من عام 2013 من قبل جمعية أمن المعلومات الباكستانية وتوسع البرنامج ليشمل جامعات البلادضمن عمليات الحرب الإلكترونية يجب على الفرد التعرف على الجهات الفاعلة الحكومية المشاركة في ارتكاب هذه الهجمات الإلكترونية ضد بعضها البعض اللاعبان الغالبان اللذان سيتم مناقشتهما هما المقارنة القديمة بين الشرق والغرب وقدرات الصين الإلكترونية مقارنة بقدرات الولايات المتحدة هناك العديد من الجهات الفاعلة الحكومية وغير الحكومية المشاركة في الحرب الإلكترونية مثل روسيا وإيران والعراق والقاعدة علماً بأن الصين والولايات المتحدة تتصدران مقدرات الحرب الإلكترونية فهما سيكونان الممثلان الوحيدان اللذان تمت مناقشتهماولكن في الربع الثاني من عام 2013 أفادت شركة أكاماي تكنولوجيز أن إندونيسيا أطاحت بالصين بنسبة 38 في المائة من الهجوم السيبراني بزيادة كبيرة من نسبة 21 في المائة في الربع السابق الصين 33 في المئة والولايات المتحدة 69 في المئة وجاء 79 في المئة من الهجوم من منطقة آسيا والمحيط الهادئ سيطرت اندونيسيا على الهجوم على الموانئ 80 و 443 بنحو 90 في المئة25طور جيش التحرير الشعبي الصيني PLA إستراتيجية تسمى «الحرب الإلكترونية المتكاملة للشبكات» التي توجه عمليات شبكة الكمبيوتر وأدوات الحرب الإلكترونية  تساعد هذه الاستراتيجية في ربط أدوات الحرب الشبكية بأسلحة الحرب الإلكترونية ضد أنظمة معلومات الخصم أثناء الصراع إنهم يعتقدون أن الأساسيات لتحقيق النجاح تتعلق بالتحكم في تدفق معلومات الخصم وإنشاء هيمنة المعلومات يعرّف كل من «علم الحرب» و «علم الحملات» شبكات الأنظمة اللوجيستية للعدو كأولوية قصوى للهجمات السيبرانية ويذكر أن الحرب الإلكترونية يجب أن تكون علامة البدء إذا كانت الحملة المستخدمة بشكل صحيح تمكن من النجاح التشغيلي الشامل26 مع التركيز على مهاجمة البنية التحتية للخصم لتعطيل عمليات نقل المعلومات والمعلومات التي تملي عمليات صنع القرار سيؤمن جيش التحرير الشعبى هيمنة الإنترنت على خصمهمالأساليب الغالبة التي سيتم استخدامها أثناء الصراع للحصول على اليد العليا هي كما يلي فإن جيش التحرير الشعبى الصينى سوف يضرب مع التشويش الإلكتروني والخداع الإلكتروني وتقنيات القمع لمقاطعة عمليات نقل المعلومات فقد يشنون هجمات فيروسية أو تقنيات اختراق لتخريب عمليات المعلومات كل ذلك على أمل تدمير منصات ومنشآت معلومات العدو أشار علم الحملات التابع لجيش التحرير الشعبي إلى أن أحد دور الحرب الإلكترونية هو خلق نوافذ من الفرص لقوات أخرى للعمل دون اكتشاف أو مع خطر أقل لهجوم مضاد من خلال استغلال فترات العدو من «العمى» أو «الصمم» أو «الشلل» التي أنشأتها هجوم المقاهي هذه هي واحدة من النقاط المحورية الرئيسية للبرامج الإلكترونية لتكون قادرًا على إضعاف عدوك إلى أقصى حد ممكن حتى يكون هجومك البدني على نسبة مئوية أعلى من النجاحيجري جيش التحرير الشعبى الصينى تدريبات منتظمة في مجموعة متنوعة من البيئات مع التركيز على استخدام تقنيات وطرق وأساليب الحرب الإلكترونية في مواجهة مثل هذه التكتيكات إذا تم استخدامها ضدهم تركز أبحاث أعضاء هيئة التدريس على التصميمات الخاصة باستخدام الجذور الخفية واكتشافها لنظام التشغيل Kylin الذي يساعد على زيادة تدريب تقنيات الحرب الإلكترونية لهؤلاء الأفراد تعتبر الصين بأن الحرب الإلكترونية رادعا للأسلحة النووية وتمتلك القدرة على مزيد من الدقة وترك خسائر أقل والسماح بهجمات طويلة المدىفي الغرب تقدم الولايات المتحدة «نغمة صوت» مختلفة عندما تكون الحرب الإلكترونية على لسان الجميع تقدم الولايات المتحدة خططًا أمنية صارمة في الرد على الحرب الإلكترونية وتستمر بشكل أساسي في وضع دفاعي عندما تتعرض للهجوم من خلال الأساليب السيبرانية الملتوية في الولايات المتحدة تنقسم مسؤولية الأمن السيبراني بين وزارة الأمن الداخلي ومكتب التحقيقات الفيدرالي ووزارة الدفاع في السنوات الأخيرة تم إنشاء قسم جديد يميل بشكل خاص إلى تهديدات الإنترنت وتعرف هذه الإدارة باسم Cyber Command  Cyber Command هي قيادة فرعية تابعة للقيادة الإستراتيجية الأمريكية وهي مسؤولة عن التعامل مع التهديدات التي تواجه البنية التحتية السيبرانية العسكرية تشتمل عناصر الخدمة في Cyber Command على قيادة الجيش Cyber Command  والقوة الجوية الرابعة والعشرين27إن العمل المضمون في الخطة يأمل بأن يتمكن الرئيس من التنقل والتحكم في أنظمة المعلومات وأن يكون لديه أيضًا خيارات عسكرية متوفرة عندما يحتاج تشريع الدفاع عن الأمة إلى الفضاء الإلكتروني يجب أن ينتبه الأفراد في Cyber Command إلى الجهات الفاعلة الحكومية وغير الحكومية التي تطور قدرات الحرب الإلكترونية في القيام بالتجسس الإلكتروني والهجمات الإلكترونية الأخرى ضد الأمة وحلفائها تسعى Cyber Command إلى أن تكون عاملاً ردعيًا لثني الأعداء المحتملين عن مهاجمة الولايات المتحدة بينما تكون إدارة متعددة الأوجه في إدارة العمليات الإلكترونية الخاصة بهايوجد هناك ثلاثة أحداث بارزة وقعت والتي قد تكون محفزة للغاية في إنشاء فكرة Cyber Command كان هناك فشل في البنية التحتية الحيوية التي أبلغت عنها وكالة المخابرات المركزية الأمريكية حيث أدت الأنشطة الضارة ضد أنظمة تكنولوجيا المعلومات إلى تعطيل قدرات الطاقة الكهربائية في الخارج وقد أدى ذلك إلى انقطاع التيار الكهربائي لعدة مدن في مناطق متعددة الحدث الثاني كان استغلال الخدمات المالية العالمية في شهر تشرين الثاني نوفمبر من عام 2008 كان لدى أحد البنوك الدولية معالج دفع مخترق سمح بإجراء معاملات احتيالية في أكثر من 130 ماكينة صراف آلي في 49 مدينة خلال 30 دقيقة28 وكان الحدث الأخير الثالث هي الخسارة الشاملة للقيمة الاقتصادية للولايات المتحدة عندما قدرت صناعة في عام 2008 خسائر بقيمة 1 تريليون دولار في الملكية الفكرية لسرقة البيانات على الرغم من أن كل هذه الأحداث كانت كوارث داخلية إلا أنها كانت بطبيعتها حقيقية مما يعني أنه لا يوجد شيء يمكن أن يوقف الجهات الحكومية أو غير الحكومية عن فعل الشيء نفسه على نطاق أعظم تم إنشاء مبادرات أخرى مثل المجلس الاستشاري للتدريب على الإنترنت لتحسين جودة وكفاءة وكفاية التدريب للدفاع عن شبكات الكمبيوتر والهجوم واستغلال عمليات العدو عبر الإنترنتوعلى جهة أخرى مقابلة لهذا النوع الطيفي تظهر دول الشرق والغرب تباين «السيف والدرع» في الأمثال العليا لدى الصينيين فكرة أكثر عدوانية عن الحرب الإلكترونية في محاولة للحصول على الضربة الوقائية في المراحل الأولى من الصراع لكسب اليد العليا في الولايات المتحدة هناك المزيد من التدابير الرجعية التي يتم اتخاذها لإنشاء أنظمة ذات حواجز لا يمكن اختراقها لحماية الأمة ومدنييها من الهجمات الإلكترونيةوفقًا ل Homeland Preparedness News  فإن العديد من الشركات الأمريكية متوسطة الحجم تواجه صعوبة في الدفاع عن أنظمتها ضد الهجمات الإلكترونية حوالي 80 في المائة من الأصول المعرضة للهجوم السيبراني مملوكة لشركات ومنظمات خاصة قال نائب وزير السلامة العامة السابق لولاية نيويورك السابق مايكل بالبوني إن الكيانات الخاصة «لا تملك نوع القدرة أو النطاق الترددي أو الاهتمام أو الخبرة لتطوير تحليل إلكتروني استباقي»29رداً على الهجمات الإلكترونية في يوم 1 من شهر أبريل بعام 2015 أصدر الرئيس أوباما أمرًا تنفيذيًا يحدد أول عقوبات اقتصادية على الإطلاق سيؤثر الأمر التنفيذي على الأفراد والكيانات «المصممين» المسؤولين عن الهجمات الإلكترونية التي تهدد الأمن القومي أو السياسة الخارجية أو الصحة الاقتصادية أو الاستقرار المالي للولايات المتحدة على وجه التحديد يأذن الأمر التنفيذي لوزارة الخزانة بتجميد أصول المعينين أيضاً30وفقا لكتاب تيد كوبل في عام 2008 قامت الولايات المتحدة بالتعاون مع إسرائيل بشن هجوم إلكتروني على البرنامج النووي الإيراني ليصبح «أول من استخدم سلاح رقمي كأداة للجوانب السياسية»31بدأت سلسلة من الهجمات الإلكترونية القوية في يوم 27 من شهر يونيو لعام 2017 والتي أغرقت مواقع المنظمات الأوكرانية بما في ذلك البنوك والوزارات والصحف وشركات الكهرباءخلال كأس العالم 2018 FIFA  واجهت روسيا وأوقفت حوالي 25 مليون هجوم إلكتروني على البنية التحتية لتكنولوجيا المعلومات32في شهر يونيو بعام 2019 اعترفت روسيا بأنه «ممكن» أن شبكتها الكهربائية تتعرض لهجوم إلكتروني من قبل الولايات المتحدة33 ذكرت صحيفة نيويورك تايمز أن المتسللين الأمريكيين من الولايات المتحدة Cyber Command زرعوا برامج ضارة يحتمل أن تكون قادرة على تعطيل الشبكة الكهربائية الروسية34كانت الهجمات الإلكترونية لعام 2007 على إستونيا عبارة عن سلسلة من الهجمات الإلكترونية التي بدأت في يوم 27 من شهر أبريل لعام 2007 واستهدفت مواقع الويب الخاصة بالمنظمات الإستونية بما في ذلك البرلمان الإستوني والمصارف والوزارات والصحف والمذيعون  وسط خلاف في روسيا بشأن نقل جندي تالين البرونزي  علامة مقبرة من الحقبة السوفيتية  وكذلك مقابر للحرب في تالين3536 أدت الهجمات إلى قيام عدد من المنظمات العسكرية حول العالم بإعادة النظر في أهمية أمن الشبكات للعقيدة العسكرية الحديثة وكانت النتيجة المباشرة للهجمات الإلكترونية هي إنشاء مركز التميز للدفاع السيبراني التابع لمنظمة حلف شمال الأطلسي في تالينفي عام 2019 ذكرت رويترز أن الإمارات العربية المتحدة شنت سلسلة من الهجمات الإلكترونية على خصومها السياسيين والصحفيين ونشطاء حقوق الإنسان في إطار مشروع الغراب على منصة تجسس وهي كارما ضم الفريق عملاء مخابرات أمريكيين سابقين بدأ مشروع Raven في عام 2009 وتم التخطيط لاستمراره في السنوات العشر القادمة37تعمل صناعة بأكملها في محاولة لتقليل احتمالية حدوث هجوم إعلامي إلى الحد الأدنىللحصول على قائمة جزئية  انظر شركات برامج أمان الكمبيوترأنها توفر منتجات وخدمات مختلفة  تهدف إلىتحاول العديد من المؤسسات تصنيف الثغرة الأمنية ونتائجها قاعدة بيانات الثغرات الأكثر شهرة هي الثغرات الأمنية والتعرضات الشائعة يتم تشكيل فرق الاستجابة للطوارئ بالكمبيوتر من قبل الحكومة والمؤسسات الكبيرة للتعامل مع حوادث أمان الكمبيوتربمجرد بدء الهجوم الإلكتروني  هناك بعض الأهداف التي يجب مهاجمتها لشل الخصم وقد تم تسليط الضوء على بعض البنى التحتية كأهداف باعتبارها بنى تحتية حرجة في وقت الصراع الذي يمكن أن يشل بشدة الأمة تعتبر أنظمة التحكم  وموارد الطاقة  والتمويل  والاتصالات السلكية واللاسلكية  والنقل  ومرافق المياه أهدافاً أساسية للبنية التحتية خلال النزاع تقرير جديد حول مشكلات الأمن السيبراني الصناعي  أعده معهد كولومبيا البريطانية للتكنولوجيا ومجموعة PA الاستشارية  باستخدام بيانات تعود إلى عام 1981 حسب التقارير  وجدت زيادة بمقدار 10 أضعاف في عدد الهجمات الإلكترونية الناجحة على أنظمة التحكم في البنية التحتية والحصول على البيانات SCADA منذ عام 200014 تُعرف الهجمات الإلكترونية التي لها تأثير مادي سلبي بالهجمات الإلكترونية الفيزيائية38أنظمة التحكم مسؤولة عن تفعيل ومراقبة الضوابط الصناعية أو الميكانيكية يتم دمج العديد من الأجهزة مع منصات الكمبيوتر للتحكم في الصمامات والبوابات في بعض البنى التحتية المادية عادة ما يتم تصميم أنظمة التحكم كأجهزة القياس عن بعد التي ترتبط بالأجهزة المادية الأخرى من خلال الوصول إلى الإنترنت أو أجهزة المودم يمكن توفير قدر ضئيل من الأمان عند التعامل مع هذه الأجهزة  مما يمكّن العديد من المتسللين أو إرهابي الإنترنت من البحث عن نقاط ضعف منهجية أوضح بول بلومجرن  مدير هندسة المبيعات في شركة الأمن السيبراني  كيف قاد فريقه إلى محطة فرعية عن بعد  ورأى هوائي شبكة لاسلكية وتم توصيله على الفور ببطاقات الشبكة المحلية اللاسلكية الخاصة بهم لقد أخرجوا أجهزة الكمبيوتر المحمولة الخاصة بهم ومتصلين بالنظام لأنه لم يكن يستخدم كلمات المرور وقال بلومجرن «خلال 10 دقائق  قاموا بتخطيط كل قطعة من المعدات في المنشأة» «في غضون 15 دقيقة  قاموا بتعيين كل قطعة من المعدات في شبكة التحكم التشغيلية في غضون 20 دقيقة  كانوا يتحدثون إلى شبكة الأعمال وقد سحبوا العديد من تقارير الأعمال حتى أنه تم افتعال كل ذلك وهم لم يغادروا السيارة أبدًا» 39تعتبر الطاقة هي البنية التحتية الثانية التي يمكن مهاجمتها يتم تقسيمها إلى فئتين  الكهرباء والغاز الطبيعي الكهرباء  والتي تعرف أيضًا باسم شبكات الكهرباء أو مدن المدن والمناطق والأسر  تعمل على تشغيل الآلات والآليات الأخرى المستخدمة في الحياة اليومية باستخدام الولايات المتحدة كمثال  يمكن للإرهابيين الإلكترونيين في حالة تعارض الوصول إلى البيانات من خلال «التقرير اليومي لحالة النظام» الذي يوضح تدفقات الطاقة عبر النظام ويمكنه تحديد الأقسام الأكثر ازدحامًا في الشبكة بإغلاق هذه الشبكات  يمكن أن تسبب هستيريا جماعية  وتراكم  وارتباك  أيضا أن تكون قادرة على تحديد المناطق الحساسة للعملية لمزيد من الهجمات بطريقة أكثر مباشرة يمكن للإرهابيين عبر الإنترنت الوصول إلى تعليمات حول كيفية الاتصال بإدارة الطاقة في Bonneville والتي تساعدهم في توجيههم حول كيفية عدم خطأ النظام في العملية هذه ميزة كبيرة يمكن الاستفادة منها عند شن هجمات إلكترونية لأن المهاجمين الأجانب الذين ليس لديهم علم مسبق بالنظام يمكنهم الهجوم بأعلى دقة دون عيوب تسير الهجمات الإلكترونية على منشآت الغاز الطبيعي بنفس الطريقة التي تتبعها الهجمات على الشبكات الكهربائية يمكن للإرهابيين عبر الإنترنت إيقاف هذه المنشآت التي توقف التدفق أو يمكنهم حتى إعادة توجيه تدفق الغاز إلى قسم آخر يمكن أن يشغله أحد حلفائهم كانت هناك حالة في روسيا لدى شركة غاز معروفة باسم غازبروم  فقد فقدوا السيطرة على لوحة التبديل المركزية الخاصة بهم والتي تقوم بتوجيه تدفق الغاز  بعد أن تجاوز المشغل الداخلي وبرنامج حصان طروادة الأمن39يمكن أن تتعرض البنية التحتية المالية لضربات شديدة من الهجمات الإلكترونية لأن النظام المالي مرتبط بأنظمة الكمبيوتر3 وهي في الأصل عبارة عن أموال ثابتة يتم تبادلها في هذه المؤسسات  وإذا تعرض الإرهابيون للهجوم  وإذا تمت إعادة توجيه المعاملات وسرقت مبالغ كبيرة من المال  فستنهار الصناعات المالية ويصبح المدنيون بلا وظائف وبلا أمن ستتعطل العمليات من منطقة إلى أخرى مسببة تدهورًا اقتصاديًا على مستوى البلاد في الولايات المتحدة وحدها  بلغ متوسط حجم المعاملات اليومية 3 تريليونات دولار  و 99٪ منها عبارة عن تدفق غير نقدي39 وفي الحقيقة وبشكل بديهي  أن تكون قادر على تعطيل هذا المبلغ من المال ليوم واحد أو لمدة عدة أيام محدودة يمكن أن يسبب أضرارا دائمة من شأنها بأن تجعل المستثمرين يقوموا بالانسحاب من التمويل مما سيأدي هذا الأمل إلى تآكل ثقة الجمهورقد تتم الإشارة إلى الهجوم السيبراني على مؤسسة مالية أو معاملات على أنها داخل عالم الإنترنت  قد تبدأ هذه الهجمات بالخداع الذي يستهدف الموظفين  باستخدام الهندسة الاجتماعية لاقناع واقتناء المعلومات منهم قد يسمحون للمهاجمين بالاختراق بالشبكة ووضع مدوِّن المفاتيح على أنظمة المحاسبة  بمرور الوقت  يستطيع مجرمون الإنترنت الحصول على معلومات كلمة المرور والمفاتيح يمكن بعد ذلك الوصول إلى الحسابات المصرفية للمنظمة عبر المعلومات التي سرقتها ومن ثم الدخول إلى كافة الأصول باستخدام keyloggers40 في شهر مايو من عام 2013 سرقت عصابة 40 مليون دولار أمريكي من عالم الإنترنت من بنك مسقط41للهجوم الإلكتروني نتائج مباشرة على البنية التحتية للاتصالات أصبح تكامل الاتصالات ممارسة شائعة  حيث يتم دمج أنظمة مثل شبكات الصوت وشبكات بروتوكول الإنترنت يتم تشغيل كل شيء عبر الإنترنت لأن السرعات وقدرات التخزين لا حصر لها يمكن إدارة هجمات رفض الخدمة كما ذكر سابقًا  ولكن يمكن إجراء هجمات أكثر تعقيدًا على بروتوكولات توجيه BGP أو البنى التحتية DNS من غير المرجح أن يستهدف أي هجوم أو يعرض للخطر شبكة الاتصال التقليدية للمفاتيح SS7 أو محاولة الهجوم على الأجهزة المادية مثل محطات الميكروويف أو منشآت الأقمار الصناعية وستظل هناك إمكانية لإغلاق تلك المنشآت المادية لتعطيل شبكات الاتصالات الهاتفية تتمثل الفكرة الكاملة حول هذه الهجمات الإلكترونية في عزل الناس عن بعضهم البعض  وتعطيل الاتصال  وبعمل ذلك  لإعاقة المعلومات الهامة التي يتم إرسالها وتلقيها في الحرب الإلكترونية  هذه طريقة مهمة لاكتساب اليد العليا في أي صراع من خلال التحكم في تدفق المعلومات والاتصالات  يمكن للأمة أن تخطط لشن ضربات أكثر دقة وأن تتخذ تدابير أفضل للهجوم المضاد على أعدائهاالبنية التحتية للنقل تعكس مرافق الاتصالات  عن طريق إعاقة النقل للأفراد في مدينة أو منطقة  فإن الاقتصاد سوف يتدهور قليلاً مع مرور الوقت يمكن أن تؤثر الهجمات الإلكترونية الناجحة على الجدولة وإمكانية الوصول في عمليات النقل  مما قد يؤدي إلى حدوث خلل في السلسلة الاقتصادية سوف تتأثر طرق الحمل والمركبات  مما يجعل من الصعب إرسال البضائع من مكان إلى آخر في شهر كانون الثاني يناير بعام 2003 خلال فيروس يسمى ب slammer اضطرت Continental Airlines إلى إغلاق الرحلات بسبب مشاكل في الكمبيوتر39 يمكن للإرهابيين عبر الإنترنت استهداف خطوط السكك الحديدية عن طريق تعطيل المفاتيح  واستهداف برامج الطيران لإعاقة الطائرات  واستهداف استخدام الطرق لإعاقة المزيد من طرق النقل التقليدية في شهر مايو بعام 2015 كشف رجل يدعى كريس روبرتس  كان مستشارًا للفضاء الإلكتروني  لمكتب التحقيقات الفيدرالي أنه نجح مرارًا وتكرارًا  من عام 2011 إلى عام 2014 في اختراق أدوات التحكم في رحلات بوينغ وإيرباص عبر نظام الترفيه على متن الطائرة  كما زُعم  وكان في مرة واحدة على الأقل قد أمر الرحلة بالإقلاع أجرى مكتب التحقيقات الفيدرالي  بعد احتجازه في أبريل عام 2015 في سيراكيوز  مقابلة معه بشأن المزاعم42يمكن أن تكون البنية التحتية للمياه واحدة من أكثر البنى التحتية أهمية للهجوم ويعتبر أحد أكبر المخاطر الأمنية بين جميع الأنظمة التي يتم التحكم فيها بواسطة الكمبيوتر هناك إمكانية لإطلاق كميات هائلة من المياه في منطقة يمكن أن تكون غير محمية مسببة خسائر في الأرواح وأضرار في الممتلكات ليست حتى إمدادات المياه التي يمكن مهاجمتها  أنظمة المجاري يمكن أن تتعرض للخطر أيضا لم يتم حساب تكلفة الأضرار  لكن التكلفة المقدرة لاستبدال شبكات المياه الحرجة قد تصل إلى مئات المليارات من الدولارات39 يتم تطوير معظم هذه البنى التحتية للمياه بشكل جيد مما يجعل من الصعب على الهجمات الإلكترونية التسبب في أي ضرر كبير  على الأكثر  يمكن أن يحدث عطل في المعدات مما يؤدي إلى انقطاع التيار الكهربائي لفترة قصيرةوصلت الهجوم السبراني إلى حد القتل في أحد المستشفيات  ففي شهر 9 من عام 2020 توفيت امرأة في دوسلدورف في أحد المستشفيات الألمانية بعد تعطل نظام الحاسوب بسبب برنامج للقرصنة بواسطة الفدية وهو برنامج خبيث يقيد الوصول إلى نظام الحاسوب الذي يصيبه ويعكس هذا الهجوم الإلكتروني مدى هشاشة القطاع الصحي في مواجهة هذه الهجمات وقال الكاتب أنوش سيدتاغيا في تقرير نشرته صحيفة لوتون le temps السويسرية إنه لم يحدث أن سُجلت حالات وفاة نتيجة هجوم إلكتروني ولكن تسبب هجوم سيبراني في وفاة مريضة في مستشفى بدوسلدورف نتيجة عدم تلقيها للعلاج وأعلنت السلطات الألمانية عن العواقب المأساوية للهجوم السيبراني «الإلكتروني» الذي استهدف الشبكة الإلكترونية للمستشفى الجامعي في دوسلدورف ليصيب أنظمته بالشلل الجزئي منذ 9 سبتمبرأيلول43وبرنامج الفدية المعروف باسم «رانسوم وير» هو برنامج ضار يستهدف نقاط الضعف في برامج معينة للسماح للمهاجمين بالتحكم عن بُعد في أنظمة الحاسوب ومقابل إعادة الوصول إلى الملفات المحملة على أجهزة الحاسوب عادة ما يطلب المخترق فدية تصل إلى عشرات أو حتى مئات الآلاف من الفرنكات43","score":9
  },
  {
    "title": "الهيئة الوطنية للأمن السيبراني",
    "article": "الهيئة الوطنية للأمن السيبراني هي هيئة حكومية مختصة في الأمن السيبراني في السعودية مهتمة في شؤونه وفي زيادة عدد الكوادر الوطنية المؤهلة لتشغيله لها شخصية مستقلة وترتبط مباشرة بالملك سلمان بن عبدالعزيز آل سعود ويرأس مجلس إدارتها وزير الدولة الدكتور مساعد العيبان تأسست بأمر ملكي في عام 2017123 سجلت الهيئة أهم إنجازاتها في مارس 2019م عندما صنف الاتحاد الدولي للاتصالات المملكة العربية السعودية في المرتبة 13 عالميا والأولى عربيًا من بين 175 دولة من خلال المؤشر العالمي للأمن السيبراني GCI الذي يتم قياسه بشكل دوري كل عامين بناء على خمس ركائز رئيسية تتمثل في القانونية والتعاونية والتقنية والتنظيمية وبناء القدرات4تهدف الهيئة إلى تعزيز حماية الشبكات وأنظمة تقنية المعلومات وأنظمة التقنيات التشغيلية ومكوناتها من أجهزة وبرمجيات وما تقدمه من خدمات وما تحويه من بيانات مراعية في ذلك الأهمية الحيوية المتزايدة للأمن السيبراني في حياة المجتمعات ومستهدفة التأسيس لصناعة وطنية في مجال الأمن السيبراني تحقق للمملكة الريادة في هذا المجال انطلاقاً مما تضمنته رؤية المملكة العربية السعودية 2030 وتتلخص الأهداف فيما يلي5 تعزيز الأمن السيبراني للدولة وحماية مصالح المملكة الحيوية وحماية أمن المملكة الوطني وحماية البنى التحتية الحساسة في المملكة أيضًا من أولويات الاتحاد5هو برنامج أطلقته الهيئة الوطنية للأمن السيبراني لتدريب الموظفين الحكوميين وطلبة الجامعة المتخصصين في نظام الأمن السيبراني واشتمل على دورتين تدريب لمدة 4 أسابيع عملي ونظري تحت عنوان «الاختراق الأخلاقي والأمن السيبراني لأنظمة التشغيل وشبكات الحاسب»6هي مبادرة أطلقت بالاشتراك مع وزارة التعليم ضمن برنامج خادم الحرمين الشريفين للابتعاث الخارجي وجاءت لتلبية الاحتياج والنقص في الكوادر الوطنية في مجال الأمن السيبراني والرغبة في زيادة عدد العاملين في ذات المجال7يهدف لتأهيل خريجي الجامعات والكليات في مجالات الأمن السيبراني والمجالات ذات العلاقة بالمهارات اللازمة لوظائف الأمن السيبراني من خلال برنامج تدريبي مكثف يتم تنفيذه بالشراكة مع الشركة السعودية لتقنية المعلومات «سايت»8يعمل المركز الوطني الإرشادي للأمن السيبراني على تعزيز جهود المملكة في رفع مستوى الوعي بالأمن السيبراني وذلك من خلال رفع الوعي والمعرفة بالأمن السيبراني لتجنب المخاطر السيبرانية وتقليل آثارها عن طريق إصدار التنبيهات بآخر وأخطر الثغرات وإطلاق حملات وبرامج توعوية والتعاون مع المراكز الإرشادية الأخرى9مبادرة تستهدف تمكين الابتكار في مجالات الأمن السيبراني ودعم مساعي الهيئة في تنمية القطاع وتأهيل القدرات الوطنية المتخصصة وبنائها في مجالات الأمن السيبراني المبادرة حائزت على التميز الدولي خلال فعاليات منتدى القمة العالمية لمجتمع المعلومات 202210 المبادرة توفر الدعم اللازم للأعمال عبر تسهيل الإجراءات وتقديم الاستشارات السيبرانية إضافة إلى تمويل المشاريع الواعدة في مجال الأمن السيبراني وشارك بها أكثر من 855 مشاركاً مثّلوا 216 فريقاً وقدموا 118 مشروعاً في الأمن السيبرانيفي عام 2022م تم إنشاء المعرض بأساليب مبتكرة وتفاعلية لدى منسوبي الجهات الوطنية داخل مقار تلك الجهات بهدف رفع مستوى الوعي بالأمن السيبراني وحمايةً للمصالح الحيوية للمملكة والبنى التحتية الحساسة والخدمات والأنشطة الحكومية11يتكون المعرض من أربعة أجنحة وهي11نفّذت الهيئة العديد من المبادرات والبرامج والتمارين السيبرانية المتقدمة على المستوى الوطني الرامية إلى تطوير وتوعية الكوادر السيبرانية في الجهات الوطنية حيث عقدت الهيئة حت منتصف 2022 نحو 45 تمريناً سيبرانياً وقامت بتمكين أكثر من 3600 مختص في مجال الأمن السيبراني يمثلون 200 جهة مستفيدة إضافة إلى تطوير المهارات السيبرانية للعديد من حديثي التخرج ورفع مستوى التوعية السيبرانية لأكثر من 7200 مستفيد10حصلت الهيئة الوطنية للأمن السيبراني على شهادة التميز في القمة العالمية لمجتمع المعلومات WSIS 2022 عن فئة «بناء الثقة والأمن في استخدام تكنولوجيا المعلومات والاتصالات» نظير دورها البارز في تمكين الابتكار وبناء القدرات الوطنية المتخصصة في مجال الأمن السيبراني بالمملكة حيث اختيرت مبادرتها «تحدي الأمن السيبراني» ضمن المشروعات المتميزة وفقاً لآراء الخبراء ولجان التحكيم في وكالة الأمم المتحدة المتخصصة في تكنولوجيا المعلومات والاتصالات1012","score":6
  },
  {
    "title": "الأمن السيبراني في السعودية",
    "article": "الأمن السيبراني في السعودية هو حماية الشبكات وأنظمة تقنية المعلومات وأنظمة التقنيات التشغيلية ومكوناتها من أجهزة وبرمجيات وما تقدمه من خدمات وما تحويه من بيانات من أي اختراق أو تعطيل أو تعديل أو دخول أو استخدام أو استغلال غير مشروع ويشمل مفهوم الأمن السيبراني أمن المعلومات والأمن الإلكتروني والأمن الرقمي ونحو ذلك1في يونيو 2021 أعلن عن تحقيق السعودية المرتبة الثانية عالميا من بين 193 دولة والمركز الأول على مستوى الوطن العربي والشرق الأوسط وقارة آسيا في المؤشر العالمي للأمن السيبراني الذي تصدره وكالة الأمم المتحدة المتخصصة في تكنولوجيا المعلومات والاتصالات «الاتحاد الدولي للاتصالات» 1 محققةً بذلك قفزة ب 11 مرتبة عن العام 2018م وبأكثر من 40 مرتبة منذ إطلاق رؤية السعودية 2030 حيث كان ترتيبها 46 عالميًا في نسخة المؤشر للعام 2017م2وفي يونيو 2024 ووفقاً لتقرير الكتاب السنوي للتنافسية العالمية لعام 2024 الصادر عن مركز التنافسية العالمي بسويسرا حققت السعودية المرتبة الأولى عالمياً في مؤشر الأمن السيبراني3هي بوابة إلكترونية تهدف إلى رفع مستوى الأمن السيبراني بالمملكة لإدارة ودعم آليات التواصل للجهات الوطنية وتقديم الخدمات والحلول السيبرانية حيث أنها تحتوي على منصات تساعد على التقييم والاستجابة وتحسين كفاءة الإنفاق في المجال ورفع مستوى الالتزام بالضوابط والتشريعات الصادرة عنها وذلك وفق أفضل الممارسات الدولية4هذه بذرة مقالة عن موضوع متعلق بالسعودية بحاجة للتوسيع فضلًا شارك في تحريرها","score":5,"score":5
  },
  {
    "title": "الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز",
    "article": "الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز بالإنجليزية SFCSP Saudi Federation for Cyber Security and Programming‏ هي منظمة وطنية تحت مظلة اللجنة الأولمبية السعودية تسعى لبناء قدرات محلية واحترافية في مجال الأمن السيبراني والبرمجة بناءً على أفضل الممارسات والمعايير العالمية للوصول بالمملكة العربية السعودية إلى مصاف الدول المتقدمة في صناعة المعرفة التقنية الحديثة يرأس مجلس إدارته فيصل الخميسي12يتمثل دور الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز في345أما الركائز الإستراتيجية التي يرتكز عليها الاتحاد فهي «إلهام أجيال من المبتكرين والمحترفين بالتقنيات المتقدمة عبر سلسلة من المبادرات والمنافسات» و«تمكين الكفاءات وتطويرها عبر المعسكرات التدريبية المكثفة وإتاحة الأدوات واستثمار الفرص» و«تمكين الكفاءات وتطويرها عبر المعسكرات التدريبية المكثفة وإتاحة الأدوات واستثمار الفرص»6إقامة الأنشطة والبرامج التي تساعد في زيادة وعي المجتمع بأهمية الأمن السيبراني والبرمجة وتشجيع ودعم الشباب للاحتراف في هذه المجالاتحرص القائمين على الاتحاد السعودي لألمن السيبراني والبرمجة بأن يكون الاتحاد مبنيا على تطلعات المجتمع المحلي ومنفتحا على آراء واقتراحات المتخصصين السعوديين فقد تم عقد الورشة التحضيرية الأولى بتاريخ 30 ربيع الأول 1439 ه والموافق 18 ديسمبر 2017 م في فندق الانتركونتيننتال في الرياضوكان الهدف من هذه الورشة هو استقصاء آراء ومقترحات المتخصصين السعوديين في استشراف مستقبل الاتحاد وتأسيس المعالم الرئيسية لانطلاق الاتحاد وتركزت محاور الورشة على المنطلقات الرئيسة لبناء إستراتيجية الاتحاد وذلك من خلال عرض مقترحات أهم المنطلقات الإستراتيجية والمتضمنة ل تعريف الاتحاد والرؤية والرسالة والأهداف والمبادرات والهوية والشعار والهيكل التنظيميوتم كذلك التطرق إلى محاور أخرى كالفعاليات والتعليم والتدريب ونظام العضوية إضافة إلى مقترح لعقد لقاء موسع يدعى إليه خبراء محليين وعالميين يتم فيه مناقشة أهم التجارب العالمية في بناء المنظمات المشابهة وبناء القدرات المتخصصة وقد حضر الورشة ما يزيد عن 100 مشارك من خبراء أكاديميين وممارسين في مختلف القطاعات الوطنية الحكومية والخاصة والذين أثروا محاور الورشة باقتراحاتهم البناءة وآرائهم السديدة والتي تتناسق مع تطلعات القيادة في المملكة العربية السعودية في التحول إلى مجتمع معرفي واقتصاد تقني كما هو مرسوم في رؤية المملكة 2030ويتضمن التقرير تفاصيل ما تم مناقشته في الورشة بالإضافة إلى أهم النتائج التي تم جمعها من خال تحليل الاستبيان الموزع على المشاركين وكذلك تم توضيح أبرز التوصيات التي خلصت إليها نتائج الورشة وفي نهاية التقرير تم إضافة ما لحق تفصيلية توضح العديد من جوانب العمل على الورشة بما في ذلك النماذج التي تم استخدامها قبل وأثناء الورشة وملخص نتائج الاستبانات وعينات من الأخبار المنشورة في الصحافة عن الورشةبناء وإطلاق المبادرات التعليمية والتدريبية المتخصصة للمساعدة في تأهيل وبناء الكفاءات الوطنية المتميزةتنظيم وإقامة المسابقات والفعاليات وتشجيع روح المنافسة بالإضافة إلى دعم وتأهيل الشباب للمشاركة في المنافسات المحلية أو العالمية المتخصصة في الأمن السيبراني والبرمجةأكاديمية طويق هي مؤسسة تعليمية مقرّها مدينة الرياض أعلن الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز عن تأسيسها في أغسطس 2019 وتتخذ من جامعة الأميرة نورة بنت عبد الرحمن مقرًا لها7مبادرة الاتحاد لدعم الأندية الطلابية من خلال تحدي سايبرهب وذلك بتقديم تحديات سيبرانية مدعومة بجوائز ماليةالكراج هو مشروع وتعاون متشرك بين الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز ووزارة الإتصالات ومدينة الملك عبد العزيز للعلوم والتقنية8 أطلق وأعلن عنه في مؤتمر ليب9 وتسعى المبادرة لتوفير بيئة مناسبة لأصحاب المشاريع الناشئة ووصلهم مع المستثمرين ورواد الأعمال10يسعى مشروع الكراج ليكون وجهة ريادية ويركز الكراج على الشركات الناشئة والمنشآت الصغيرة والمتوسطة محليًا ودوليًا من خلال استهداف هذه الشركات للانضمام إلى الكراج برامجه وفعالياتهتضم المبادرة حاضنات ومسرعات أعمال وتوفر البيئة المناسبة لنجاح الشركات التقنيةيقدم برنامج الكراج العديد من المميزات تشمل منحة مالية الاستثمار التسويق برنامج تدريبي الدعم التقني مساحة عمل خدمات الشركاء والسكنأحد برامج مشروع الكراج9 والذي يسعى إلى توفير ثلاث ركائز أساسية مكان للعمل والسكن والتواصل مع من يشاركونك نفس الاهتمامفعالية شهرية تهدف إلى ربط أهم القائمين والعاملين في قطاع التقنية ببعضهم البعض9 المساهمة في تنمية السوق المحلي زيادة المعرفة تحفيز الشراكات والفرص الاستثمارية لتغيير وتطوير القطاعوتتكون فقرات الفعاليات الشهريةيُقام الماركت ضمن فعالية الكراج Disrupt ويمكن المشاركين به من عرض مشاريعهم على المسرح أمام مجموعة من المسؤولين الحكوميين أبرز شركات القطاع الخاص والمستثمرين الملائكيين والجريئين بهدف خلق فرص الاستثمار والاستحواذ والشراكات والتواصلأعضاء مجلس إدارة الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز11","score":5
  },
  {
    "title": "قوانين الأمن الإلكتروني",
    "article": "قوانين الأمن الإلكتروني أو كما تسمى غالباً ب «الأمن السيبراني» هي لوائح تشتمل على توجيهات متخصصة لحماية تقنية المعلومات وأنظمة الحاسب بغرض إجبار الشركات والمؤسسات على حماية أنظمتها ومعلوماتها من الهجمات الإلكترونية مثل الفيروسات والديدان وأحصنة طروادة والتصيد وهجمات رفض الخدمة DOS والوصول غير المصرح به كسرقة الملكية الفكرية أو المعلومات السرية وهجمات نظام التحكم وغيرها هناك العديد من التدابير المتاحة لمنع الهجمات الإلكترونيةتشمل هذه التدابير في الأمن السيبراني بناء سياسات وضوابط وأنظمة مثل إنشاء جدران الحماية وبرامج مكافحة الفيروسات وأنظمة كشف التسلل والوقاية منها والتشفير وكلمات المرور في عمليات تسجيل الدخول كانت ولازالت هناك محاولات لتحسين الأمن السيبراني من خلال التنظيم والجهود التعاونية بين الحكومة والقطاع الخاص لتشجيع التحسينات الطوعية للأمن السيبراني لاحظ مسؤولين ومنظمين الصناعة بما في ذلك المنظمون والشركاء المصرفيون المخاطر الناجمة عن الأمن السيبراني وبدأوا يخططون للبدء في إدراج الأمن السيبراني كجانب من جوانب الاختبارات التنظيمية1في عام 2011 أصدرت وزارة الدفاع الأمريكية دليلاً يطلق عليه «إستراتيجية وزارة الدفاع للعمل في الفضاء السيبراني» والذي يحدد خمسة أهداف 1 التعامل مع الفضاء الإلكتروني كمجال تشغيلي 2 استخدام مفاهيم دفاعية جديدة لحماية شبكات وأنظمة وزارة الدفاع 3 الشراكة مع وكالات أخرى والقطاع الخاص 4 السعي إلى تطبيق «إستراتيجية الأمن السيبراني للحكومة بأكملها» 5 العمل مع الحلفاء الدوليين لدعم الأمن السيبراني الجماعي ودعم تطوير القوى العاملة السيبرانية القادرة على الابتكار التقني السريع2تقرير مكتب محاسبة الحكومة الصادر في مارس 2011 حدد وصنف حماية أنظمة معلومات الحكومة الفيدرالية والبنية التحتية للإنترنت في أمريكا كمنطقة وعنصر عالي الخطورة على مستوى الحكومة مع الإشارة إلى أن أمن المعلومات الفيدرالي قد تم تعيينه كمنطقة شديدة الخطورة منذ عام 1997 في عام 2003  تم إدراج حماية البنية التحتية الحرجة وحماية البنية التحتية الحيوية السيبرانية CIPفي شهر نوفمبر من عام 2013 أصدرت وزارة الدفاع الأمريكية قاعدة ونظام الأمن السيبراني الجديد وهو 78 Fed Reg 69373 والذي فرض هذا النظام بعض المتطلبات على المقاولين مثل الامتثال لمعايير NIST IT والإبلاغ الإلزامي عن حوادث الأمن السيبراني إلى وزارة الدفاع الأمريكية3وجد تقرير ينتمي للكونجرس في شهر يونيو من عام 2013 أن هناك أكثر من 50 قانوناً يتعلق بالامتثال لقواعد وضوابط لوائح الأمن السيبراني الجدير بالذكر أن قانون إدارة أمن المعلومات الفيدرالي لعام 2002 FISMA يعد أحد القوانين الأساسية التي تحكم أنظمة الأمن السيبراني الفيدرالية 3هناك عدد قليل من لوائح الأمن السيبراني الفيدرالية وترتكز اللوائح الموجودة على صناعات محددة اللوائح الثلاثة الرئيسية للأمن السيبراني هي «قانون قابلية ومساءلة التأمين الصحي لعام 1996 HIPAA» و «قانون GrammLeachBliley لعام 1999» وقانون الأمن الداخلي لعام 2002 الذي تضمن قانون إدارة أمن المعلومات الفيدرالي FISMA تنص كل اللوائح الثلاثة على أنه ينبغي على مؤسسات الرعاية الصحية والمؤسسات المالية والوكالات الفيدرالية حماية أنظمتها ومعلوماتها على سبيل المثال FISMA والذي ينطبق على كل وكالة حكومية يتطلب تطوير وتنفيذ سياسات إلزامية ومبادئ ومعايير وإرشادات حول أمن المعلومات ومع ذلك لا تتناول اللوائح العديد من الصناعات ذات الصلة بالحاسوب مثل مزودي خدمة الإنترنت وشركات البرمجيات علاوة على ذلك لا تحدد اللوائح تدابير الأمن السيبراني التي يجب تنفيذها ولا تتطلب سوى مستوى «معقول» من الأمان اللغة الغامضة لهذه اللوائح تترك مجالاً للتفسير حيث يقول بروس شنير Bruce Schneier مؤسس شركة «كوبرتينو» لأمن الإنترنت أن الشركات لن تقوم بعمل إستثمارات كافية في مجال الأمن السيبراني ما لم تجبرها الحكومة على القيام بذلك ويذكر أيضاً أن الهجمات الإلكترونية الناجحة على الأنظمة الحكومية لا تزال تحدث رغم الجهود الحكوميةلقد اقترح أن قانون جودة البيانات يمنح مكتب الإدارة والميزانية بالفعل السلطة القانونية لتنفيذ لوائح حماية البنية التحتية الحيوية من خلال عملية وضع قواعد قانون الإجراءات الإدارية لم يتم فحص الفكرة بالكامل وستتطلب تحليلًا قانونيًا إضافيًا قبل البدء في وضع القواعد4حاولت حكومات الولايات تحسين الأمن السيبراني من خلال زيادة ظهور الجمهور للشركات ذات الأمن الضعيف في عام 2003 أقرت كاليفورنيا قانون الإخطار الأمني والذي يتطلب أن تقوم أي شركة تحتفظ بمعلومات شخصية عن مواطني كاليفورنيا ولديها خرق أمني بالكشف عن تفاصيل الحدث تتضمن المعلومات الشخصية الاسم أو رقم الضمان الاجتماعي أو رقم رخصة القيادة أو رقم بطاقة الائتمان أو المعلومات المالية والجدير بالذكر انه قد اتبعت عدة ولايات أخرى مثال كاليفورنيا وأصدرت لوائح مماثلة للإخطار بالأمن إن لوائح الإخطار بانتهاك الأمان هذه تعاقب الشركات على إخفاقاتها في مجال الأمن السيبراني مع منحها حرية اختيار كيفية تأمين أنظمتها أيضًا تخلق اللائحة حافزًا للشركات للاستثمار طوعًا في الأمن السيبراني لتجنب الفقد المحتمل للسمعة والخسارة الاقتصادية الناتجة التي يمكن أن تأتي من هجوم سيبراني ناجح5في عام 2004 أقر المجلس التشريعي لولاية كاليفورنيا مشروع قانون جمعية كاليفورنيا 1950 والذي ينطبق أيضًا على الشركات التي تمتلك أو تحافظ على المعلومات الشخصية لسكان كاليفورنيا تملي اللوائح على الشركات للحفاظ على مستوى معقول من الأمن وأنها تتطلب ممارسات أمنية تمتد أيضا إلى شركاء الأعمال يعد هذا التنظيم بمثابة تحسين للمعيار الفيدرالي لأنه يوسع عدد الشركات المطلوبة للحفاظ على مستوى مقبول من الأمن السيبراني ومع ذلك مثل التشريع الفيدرالي فإنه يتطلب مستوى «معقول» من الأمن السيبراني والذي يترك مجالًا كبيرًا للتفسير حتى يتم تأسيس السوابق القضائيةاقترح الكونجرس الأمريكي العديد من مشاريع القوانين التي تتوسع في تنظيم الأمن السيبراني يعدل قانون أمن بيانات المستهلك والإشعار به قانون GrammLeachBliley ليطلب الكشف عن المخالفات الأمنية من جانب المؤسسات المالية اقترح أعضاء الكونغرس أيضًا «توسيع GrammLeachBliley لتشمل جميع الصناعات التي تمس المعلومات المالية للمستهلك بما في ذلك أي شركة تقبل الدفع عن طريق بطاقة الائتمان» اقترح الكونغرس لوائح الأمن السيبراني على غرار قانون الإخطار الأمني الخاص بكاليفورنيا للشركات التي تحتفظ بمعلومات شخصية يتطلب قانون حماية المعلومات والأمن من سماسرة البيانات «ضمان دقة البيانات وسريتها ومصادقة وتتبع المستخدمين والكشف عن النشاط غير المصرح به ومنعه وتخفيف الضرر المحتمل للأفراد»بالإضافة إلى مطالبة الشركات بتحسين الأمن السيبراني يدرس الكونغرس أيضًا مشاريع القوانين التي تجرم الهجمات الإلكترونية قانون حماية نفسك ضد قانون التعدي على الإنترنت SPY ACT كان مشروع قانون من هذا النوع ركزت على مشروع قانون التصيّد وبرامج التجسس وتمت الموافقة عليه في يوم 23 من شهر مايو لعام 2005 في مجلس النواب الأمريكي ولكنه توقف في مجلس الشيوخ الأمريكي 5 مشروع القانون «يجعل من غير القانوني الاستخدام غير المصرح به لجهاز الكمبيوتر للسيطرة عليه وتعديل إعداداته وجمع أو حث المالك على الكشف عن معلومات التعريف الشخصية وتثبيت البرامج غير المرغوب فيها والعبث بالأمان أو برامج مكافحة التجسس أو مكافحة برنامج مكافحة الفيروسات»في يوم 12 من شهر مايو لعام 2011 اقترح باراك أوباما الولايات المتحدة حزمة من الإصلاحات التشريعية للأمن السيبراني لتحسين أمن الأشخاص في الولايات المتحدة والحكومة الفيدرالية والبنية التحتية الحيوية تلا ذلك عام من النقاش العام وجلسات الاستماع للكونغرس مما أسفر عن موافقة مجلس النواب على مشروع قانون لتبادل المعلومات  ووضع مجلس الشيوخ مشروع قانون تسوية يسعى إلى تحقيق التوازن بين الأمن القومي والخصوصية ومصالح الأعمالفي شهر يوليو بعام 2012 اقترح السناتور جوزيف ليبرمان وسوزان كولينز قانون الأمن السيبراني لعام 2012 تطلب مشروع القانون إنشاء «معايير أفضل الممارسات» الطوعية لحماية البنية التحتية الرئيسية من الهجمات الإلكترونية والتي سيتم تشجيع الشركات على تبنيها من خلال حوافز مثل حماية المسؤولية تم طرح مشروع القانون للتصويت في مجلس الشيوخ لكنه فشل في الموافقة عليه أعرب أوباما عن دعمه للقانون في مقال صحيفة وول ستريت جورنال كما تلقت دعما من مسؤولين في الجيش والأمن القومي بمن فيهم جون أو برينان كبير مستشاري مكافحة الإرهاب في البيت الأبيضوفقًا لصحيفة واشنطن بوست  قال الخبراء إن الفشل في تمرير الفعل قد يجعل الولايات المتحدة «عرضة للاختراق على نطاق واسع أو لهجمات إلكترونية خطيرة» عارض القانون أعضاء مجلس الشيوخ الجمهوريون مثل جون ماكين  الذي كان قلقًا من أن هذا القانون سيطبق لوائح لن تكون فعالة وقد تكون «عبئًا» على الشركات بعد تصويت مجلس الشيوخ صرّح السناتور الجمهوري كاي بيلي هوتشيسون بأن معارضة مشروع القانون ليست قضية حزبية ولكنها لا تأخذ النهج الصحيح تجاه الأمن السيبراني لم يكن تصويت مجلس الشيوخ صارمًا وفقًا للأحزاب الحزبية حيث صوت ستة ديمقراطيين ضده وصوت خمسة جمهوريين لصالحه من بين منتقدي مشروع القانون غرفة التجارة الأمريكية مجموعات الدعوة مثل اتحاد الحريات المدنية الأمريكي ومؤسسة الحدود الإلكترونية خبير الأمن السيبراني جودي ويستبي ومؤسسة التراث جادل كل منهما أنه على الرغم من أن الحكومة يجب أن تعمل على الأمن السيبراني فإن مشروع القانون كان معيبًا في مقاربته ويمثل «دورًا فدراليًا تدخليًا للغاية»في شهر فبراير من عام 2013 اقترح أوباما الأمر التنفيذي لتحسين الأمن السيبراني للبنية التحتية وإنه يمثل آخر تكرار للسياسة ولكنه لا يعتبر قانونًا لأن الكونغرس لم يتناوله بعد وهو أيضاً يسعى إلى تحسين الشراكات الحالية بين القطاعين العام والخاص من خلال تعزيز توقيت تدفق المعلومات بين DHS وشركات البنية التحتية الحيوية تواجه الوكالات الفيدرالية لتبادل التحذيرات الاستخباراتية تهديدات الإنترنت إلى أي كيان من القطاع الخاص التي تم تحديدها كهدف كما أنه يكلف وزارة الأمن الوطني بتحسين عملية الإسراع في عمليات التخليص الأمني لكيانات القطاعين العام والخاص المطبقة لتمكين الحكومة الفيدرالية من مشاركة هذه المعلومات على المستويات الحساسة والمصنفة المناسبة يوجه تطوير إطار عمل لتقليل مخاطر الإنترنت مع دمج أفضل الممارسات الصناعية الحالية والمعايير الطوعية أخيرًا تقوم بمهمة الوكالات الفيدرالية المشاركة في دمج حماية الخصوصية والحريات المدنية وفقًا لمبادئ الممارسة العادلة للمعلومات6في شهر يناير لعام 2015 أعلن أوباما عن اقتراح تشريعي جديد للأمن السيبراني تم تقديم الاقتراح في محاولة لإعداد الولايات المتحدة من العدد المتزايد لجرائم الإنترنت في الاقتراح أوجز أوباما ثلاثة جهود رئيسية للعمل من أجل الفضاء الإلكتروني ليكون أكثر أمنا للولايات المتحدة أكد بأن الجهد الرئيسي الأول هو أنه يقوم على أهمية تمكين تبادل معلومات الأمن السيبراني من خلال تمكين ذلك شجع الاقتراح تبادل المعلومات بين الحكومة والقطاع الخاص سيسمح ذلك للحكومة بمعرفة التهديدات السيبرانية الرئيسية التي تواجهها الشركات الخاصة ثم يسمح للحكومة بتوفير الحماية للمسؤولية لتلك الشركات التي تشارك معلوماتها علاوة على ذلك من شأن ذلك أن يعطي الحكومة فكرة أفضل عما تحتاج الولايات المتحدة إلى حمايته كان من بين الجهود الرئيسية الأخرى التي تم التأكيد عليها في هذا الاقتراح تحديث سلطات إنفاذ القانون لجعلها أكثر تجهيزًا للتعامل بشكل صحيح مع الجرائم الإلكترونية عن طريق منحهم الأدوات التي يحتاجون إليها من أجل القيام بذلك كما سيتم تحديث تصنيفات الجرائم الإلكترونية والنتائج المترتبة عليهاإحدى الطرق التي سيتم بها ذلك هي جعلها جريمة لبيع المعلومات المالية في الخارج الهدف الآخر من هذا الجهد هو جعل الجرائم الإلكترونية قابلة للمقاضاة كان الجهد الرئيسي الأخير للمقترح التشريعي هو مطالبة الشركات بالإبلاغ عن انتهاك البيانات للمستهلكين إذا تم التضحية بمعلوماتهم الشخصية من خلال مطالبة الشركات بالقيام بذلك يدرك المستهلكون عندما يكونون في خطر سرقة الهوية7في شهر فبراير لعام 2016 قام أوباما بتطوير خطة عمل الأمن القومي للأمن السيبراني المسمية ب CNAP تم وضع الخطة لإنشاء إجراءات واستراتيجيات طويلة الأجل في محاولة لحماية الولايات المتحدة من التهديدات السيبرانية كان محور الخطة هو اطلاع الجمهور على التهديد المتزايد لجرائم الإنترنت وتحسين حماية الأمن السيبراني وحماية المعلومات الشخصية للأمريكيين وإبلاغ الأميركيين بكيفية التحكم في الأمن الرقمي تشمل أبرز هذه الخطة إنشاء «لجنة لتعزيز الأمن السيبراني الوطني» الهدف من هذا هو إنشاء لجنة تتألف من مجموعة متنوعة من المفكرين ذوي وجهات النظر التي يمكن أن تسهم في تقديم توصيات حول كيفية إنشاء الأمن السيبراني أقوى للقطاعين العام والخاص النقطة الثانية من هذه الخطة هي تغيير تكنولوجيا المعلومات الحكومية ستجعل تكنولوجيا المعلومات الحكومية الجديدة ذلك حتى يمكن وضع تكنولوجيا معلومات أكثر أمانًا النقطة الثالثة من هذه الخطة هي تزويد الأمريكيين بمعرفة كيف يمكنهم تأمين حساباتهم على الإنترنت وتجنب سرقة معلوماتهم الشخصية من خلال المصادقة متعددة العوامل النقطة الرابعة في الخطة هي استثمار 35٪ من الأموال التي تم استثمارها في عام 2016 في مجال الأمن السيبراني8بالإضافة إلى التنظيم حاولت الحكومة الفيدرالية تحسين الأمن السيبراني من خلال تخصيص المزيد من الموارد للبحث والتعاون مع القطاع الخاص لكتابة المعايير في عام 2003 جعلت الاستراتيجية الوطنية للرئيس لتأمين الفضاء الإلكتروني وزارة الأمن الداخلي DHS مسؤولة عن التوصيات الأمنية والبحث عن الحلول الوطنية تدعو الخطة إلى بذل جهود تعاونية بين الحكومة والصناعة «لإنشاء نظام استجابة للطوارئ للهجمات الإلكترونية ولتقليل تعرض البلاد لمثل هذه التهديدات»في عام 2004 خصص الكونغرس الأمريكي 47 مليار دولار للأمن السيبراني لتحقيق العديد من الأهداف المنصوص عليها في الاستراتيجية الوطنية للرئيس لتأمين الفضاء الإلكتروني يذكر بعض خبراء أمن الصناعة أن الاستراتيجية الوطنية للرئيس لتأمين الفضاء الإلكتروني هي خطوة أولى جيدة ولكنها غير كافية صرح بروس شنير «إن الاستراتيجية الوطنية لتأمين الفضاء الإلكتروني لم تؤمن شيئًا بعد» ومع ذلك تنص الاستراتيجية الوطنية للرئيس بوضوح على أن الغرض من ذلك هو توفير إطار لأصحاب أنظمة الكمبيوتر لتحسين أمنهم بدلاً من تولي الحكومة حل المشكلة أوحل أطرافها ومع ذلك لا يتعين على الشركات التي تشارك في الجهود التعاونية الموضحة في الاستراتيجية اعتماد حلول الأمان المكتشفةفي الولايات المتحدة يحاول الكونغرس الأمريكي جعل المعلومات أكثر شفافية بعد فشل قانون الأمن السيبراني لعام 2012 الذي كان سيخلق معايير طوعية لحماية البنية التحتية الحيوية في تمريره في مجلس الشيوخ9 في شهر فبراير 2013 أصدر البيت الأبيض أمرًا تنفيذيًا بعنوان «تحسين الأمن السيبراني للبنية التحتية الحيوية» والذي يسمح للسلطة التنفيذية بتبادل المعلومات حول التهديدات مع المزيد من الشركات والأفراد10 وفي شهر أبريل لعام 2013 أقر مجلس النواب قانون تقاسم وحماية الاستخبارات السيبرانية CISPA الذي يدعو إلى الحماية من الدعاوى القضائية التي تستهدف الشركات التي تكشف عن معلومات خرق قالت إدارة أوباما إنها قد تستخدم حق النقض ضد مشروع القانونفي ضوء الاختراق الحاصل في الموقع الإلكتروني التجاري لوكالة الفضاء الهندية في عام 2015 ذكرت شركة «أنتريكس» والبرامج الحكومية في Digital India بأن الخبير في مجال الإنترنت ومحامي في المحكمة العليا في الهند بافان دوغال Pavan Duggal يقول «التشريعات المخصصة لأمان الإنترنت هو شرط أساسي في الهند لا يكفي مجرد وضع سياسات الأمن السيبراني كجزء من قانون تقنية المعلومات علينا أن نرى الأمن السيبراني ليس فقط من منظور قطاعي ولكن أيضاً من منظور وطني»11كانت معايير الأمن السيبراني ذات أهمية كبيرة في الأعمال التجارية القائمة على التقنية اليوم ولتعظيم وزيادة الأرباح تستفيد الشركات من التقنية من خلال إدارة معظم عملياتها عبر الإنترنت حالياً نظرًا لوجود عدد كبير من المخاطر التي تنطوي على عمليات العمل عبر الإنترنت يجب حماية هذه العمليات من خلال لوائح شاملة وواسعة النطاقتغطي جميع أنظمة الأمن السيبراني الحالية جوانب مختلفة من العمليات التجارية وغالباً ما تختلف حسب المنطقة أو البلد الذي تعمل فيه الشركة نظراً للاختلافات في مجتمعات عديدة في البلدان والبنية التحتية والقيم فإن معيار الأمن السيبراني الشاملة ليست هي الأفضل لتقليل المخاطر على الرغم من أن المعايير الأمريكية توفر أساساً وضوابط واضحة للعمليات فقد أنشأ الإتحاد الأوروبي لائحة أكثر ملائمة للشركات التي تعمل بشكل خاص داخل دول الاتحاد الأوروبي أيضاً في ضوء خروج بريطانيا من الاتحاد الأوروبي من المهم النظر في كيفية العمل مع المملكة المتحدة للالتزام بهذه اللوائح الأمنيةهناك ثلاث قوانين في الاتحاد الأوروبي وهي تشمل ثلاثة لوائح رئيسية داخل الاتحاد الأوروبي ENISA  وتوجيهات NIS و GDPR للاتحاد الأوروبي يمكن وصف تلك القوانين واللوائح بتقسيمها وشرح كل لائحة على النحو التاليوكالة الاتحاد الأوروبي لأمن الشبكات والمعلومات ENISA هي وكالة حاكمة تم إنشاؤها أصلاً بموجب اللائحة EC رقم 4602004  البرلمان الأوروبي والمجلس المؤرخ ليوم 10 بشهر مارس في عام 2004 لغرض رفع أمن الشبكات والمعلومات NIS لجميع عمليات التواصل عبر الإنترنت في الاتحاد الأوروبي تعمل ENISA حاليًا وفقًا للائحة الاتحاد الأوروبي رقم 5262013  12 التي حلت محل اللوائح الأصلية في عام 2013 تعمل ENISA بنشاط مع جميع الدول الأعضاء في الاتحاد الأوروبي لتوفير مجموعة من الخدمات تركز عملياتها على ثلاثة عوامل وهيتتكون ENISA من مجلس إدارة يعتمد على دعم المدير التنفيذي ومجموعة أصحاب المصلحة الدائمين ومع ذلك فإن معظم العمليات يديرها رؤساء الإدارات المختلفة14أصدرت ENISA منشورات مختلفة تغطي جميع القضايا الرئيسية المتعلقة بالأمن السيبراني تشمل مبادرات ENISA السابقة والحالية إستراتيجية السحابة للاتحاد الأوروبي والمعايير المفتوحة في تكنولوجيا اتصالات المعلومات واستراتيجية الأمن السيبراني للاتحاد الأوروبي ومجموعة تنسيق الأمن السيبراني تعمل ENISA أيضًا بالتعاون مع المنظمات الدولية القياسية الحالية مثل ISO والاتحاد الدولي للاتصالات15في يوم 6 من شهر يوليو لعام 2016 وضع البرلمان الأوروبي في السياسة التوجيه الخاص بأمن أنظمة الشبكات والمعلومات توجيه NIS16دخل التوجيه حيز التنفيذ في شهر أغسطس بعام 2016 وتم منح جميع الدول الأعضاء في الاتحاد الأوروبي 21 شهرًا لدمج لوائح التوجيه في قوانينها الوطنية17 الهدف من توجيه NIS هو إنشاء مستوى أعلى عام للأمن السيبراني في الاتحاد الأوروبي يؤثر التوجيه بشكل كبير على مقدمي الخدمات الرقمية DSPs ومشغلي الخدمات الأساسية OES يشتمل مشغلو الخدمات الأساسية على أي منظمات ستتأثر عملياتها بشكل كبير في حالة حدوث خرق أمني إذا تورطوا في أنشطة اجتماعية أو اقتصادية حرجة يتحمل كل من مقدمي خدمات الدعم DSP و OES المسؤولية الآن عن الإبلاغ عن حوادث الأمان الرئيسية لفرق الاستجابة لحوادث أمان الكمبيوتر CSIRT18 على الرغم من أن DSPs لا تخضع لأنظمة صارمة مثل مشغلي الخدمات الأساسية فإن DSPs التي لم يتم إنشاؤها في الاتحاد الأوروبي لا تزال تعمل في الاتحاد الأوروبي ولا تزال تواجه لوائح أيضاً تخضع لها حتى إذا كانت جهات النشر والمراجعة DSP و OES تتعهد بمصادر خارجية في صيانة أنظمة المعلومات الخاصة بهم لأطراف ثالثة فإن توجيه NIS لا يزال يحمّلهم مسؤولية أي حوادث أمنية19يتعين على الدول الأعضاء في الاتحاد الأوروبي وضع إستراتيجية توجيهية ل NIS  تشمل CSIRTs  بالإضافة إلى السلطات الوطنية المختصة NCAs ونقاط الاتصال الفردية SPOCs يتم إعطاء مثل هذه الموارد مسؤولية التعامل مع انتهاكات الأمن السيبراني بطريقة تقلل من التأثير بالإضافة إلى ذلك يتم تشجيع جميع الدول الأعضاء في الاتحاد الأوروبي على مشاركة معلومات الأمن السيبراني20تتضمن متطلبات الأمان التدابير الفنية التي تدير مخاطر انتهاكات الأمن السيبراني بطريقة وقائية يجب على كل من DSP و OES توفير المعلومات التي تسمح بإجراء تقييم متعمق لأنظمة المعلومات وسياسات الأمان الخاصة بهم21 يجب إبلاغ المشرفين على جميع الحوادث الهامة يتم تحديد حوادث الأمن السيبراني الهامة من خلال عدد المستخدمين المتأثرين بالخرق الأمني وكذلك طول العمر والوصول الجغرافي للحادثتم وضع اللائحة العامة لحماية البيانات في الاتحاد الأوروبي EUR في يوم 14 من شهر أبريل لعام 2016 ولكن الموعد الحالي للتنفيذ هو يوم 25 من شهر مايو لعام 201822 يهدف هذا السجل إلى وضع معيار واحد لحماية البيانات بين جميع الأعضاء دول في الاتحاد الأوروبي تتضمن التغييرات إعادة تعريف الحدود الجغرافية ينطبق على الكيانات التي تعمل في الاتحاد الأوروبي أو تتعامل مع بيانات أي مقيم في الاتحاد الأوروبي بغض النظر عن مكان معالجة البيانات إذا كانت بيانات مواطن الاتحاد الأوروبي قيد المعالجة يخضع الكيان الآن لإجمالي الناتج المحلي23كما أن الغرامات أكثر صرامة في ظل الناتج القومي الإجمالي ويمكن أن يصل إجماليها إلى 20 مليون يورو أو 4٪ من المبيعات السنوية لأي كيان أيهما أعلى 23 بالإضافة إلى ذلك كما في اللوائح السابقة يجب الكشف عن جميع خروقات البيانات التي تؤثر على حقوق وحريات الأفراد المقيمين في الاتحاد الأوروبي في غضون 72 ساعةالمجلس الشامل مجلس حماية البيانات في الاتحاد الأوروبي EDP  هو المسؤول عن كل الرقابة التي حددها الناتج المحلي الإجماليتلعب الموافقة دورًا رئيسيًا في إجمالي الناتج المحلي يتعين على الشركات التي تحتفظ ببيانات فيما يتعلق بمواطني الاتحاد الأوروبي أن تقدم لهم أيضًا الحق في التراجع عن مشاركة البيانات بنفس السهولة التي يوافقون فيها على تبادل البيانات24بالإضافة إلى ذلك يمكن للمواطنين أيضًا تقييد معالجة البيانات المخزنة عليهم كما يمكنهم اختيار السماح للشركات بتخزين بياناتهم دون معالجتها مما يخلق تمييزًا واضحًا على عكس اللوائح السابقة يقيد إجمالي الناتج المحلي أيضًا نقل بيانات المواطن خارج الاتحاد الأوروبي أو إلى جهة خارجية دون موافقة مسبقة من المواطن 24من المخطط أيضًا تطبيق لائحة الخصوصية الإلكترونية المقترحة اعتبارًا من يوم 25 من شهر مايو لعام 2018في حين يتفق الخبراء على أن تحسينات الأمن السيبراني ضرورية هناك خلاف حول ما إذا كان الحل هو مزيد من التنظيم الحكومي أو المزيد من ابتكار القطاع الخاصيعتقد الكثير من المسؤولين الحكوميين وخبراء الأمن السيبراني أن القطاع الخاص قد فشل في حل مشكلة الأمن السيبراني وأن هناك حاجة إلى التنظيم صرح ريتشارد كلارك أن «الصناعة لا تستجيب إلا عندما تهدد التنظيم إذا لم تستجب الصناعة للتهديد  فعليك المتابعة» وهو يعتقد أنه يجب إجبار شركات البرمجيات على إنتاج برامج أكثر أمانًا يدعم Bruce Schneier أيضًا اللوائح التي تشجع شركات البرمجيات على كتابة كود أكثر أمانًا من خلال الحوافز الاقتصادية يقترح الممثل الأمريكي ريك باوتشر D VA تحسين الأمن السيبراني من خلال جعل شركات البرمجيات مسؤولة عن العيوب الأمنية في التعليمات البرمجية الخاصة بهم بالإضافة إلى ذلك لتحسين أمان البرامج يعتقد كلارك أن بعض الصناعات مثل المرافق ومقدمي خدمات الإنترنت تتطلب التنظيممن ناحية أخرى يعتقد الكثير من المسؤولين التنفيذيين في القطاع الخاص وجماعات الضغط التنظيمي السياسي أن المزيد من التنظيم سيحد من قدرتهم على تحسين الأمن السيبراني هاريس ميلر وهو أحد المعروفين من جماعات الضغط ورئيس جمعية شركات تقنية المعلومات الأمريكية يعتقد أن التنظيم يمنع الابتكار كما يعارض ريك وايت المحامي السابق للشركة والرئيس والمدير التنفيذي لمجموعة اللوبي TechNet  المزيد من التنظيم ويذكر أن «القطاع الخاص يجب أن يظل قادرًا على الابتكار والتكيف استجابة لأساليب الهجوم الجديدة في الفضاء السيبراني وتحقيقًا لهذه الغاية وأيضاً يشيد بالرئيس بوش والكونجرس لممارسة ضبطهما التنظيمي»سبب آخر يعارض العديد من المديرين التنفيذيين في القطاع الخاص بأن «التنظيم» يعتبر أنه مكلف وينطوي على إشراف الحكومة في المشاريع الخاصة الشركات مهتمة بنفس القدر بشأن اللوائح التي تقلل من الأرباح بقدر اهتمامها باللوائح التي تحد من مرونتها في حل مشكلة الأمن السيبراني بكفاءة","score":4
  },
  {
    "title": "الذكاء الاصطناعي في الأمن السيبراني",
    "article": "الذكاء الاصطناعي في الأمن السيبراني يُعد من الأدوات الأساسية التي تساهم في تحليل واكتشاف التهديدات الأمنية والاستجابة لها في الوقت الفعلي مما يقلل من حجم الأضرار المحتملة يمكن استخدام نماذج الذكاء الاصطناعي في أدوات اختبار الاختراق لتسهيل عملية جمع المعلومات واكتشاف نقاط الضعف في الأنظمة الأمنيةتشير التقديرات إلى أن حجم سوق الذكاء الاصطناعي في مجال الأمن السيبراني قد بلغ 174 مليار دولار أمريكي في عام 2022 ومن المتوقع أن يصل إلى 10278 مليار دولار أمريكي بحلول عام 2032 بمعدل نمو سنوي مركب قدره 1943٪ خلال الفترة بين عامي 2023 و20321 مع تزايد تعقيد تهديدات الأمن السيبراني مثل الهندسة الاجتماعية وبرامج الفدية أصبحت الحلول التقليدية غير قادرة على مواجهة هذه التهديدات المتطورة هنا يأتي دور الذكاء الاصطناعي الذي يقدم استراتيجيات أكثر تقدماً في الكشف عن المخاطر والوقاية منها2يمكن للذكاء الاصطناعي تحليل كميات ضخمة من البيانات للكشف عن الأنماط غير المعتادة التي قد تشير إلى وجود تهديدات سيبرانية على سبيل المثال في حال قيام موظف بالنقر على رابط تصيد احتيالي يمكن للذكاء الاصطناعي ملاحظة التغير في سلوك النظام وتنبيه فرق الأمن على الفور مما يتيح لهم اتخاذ الإجراءات المناسبة بسرعةتتمتع أنظمة الذكاء الاصطناعي بقدرة فائقة على كشف البرامج الضارة ومحاولات التصيد الاحتيالي يمكن للخوارزميات المتقدمة تحليل البريد الإلكتروني لتحديد الرسائل الاحتيالية بدقة تصل إلى 94 متفوقة على الأنظمة التقليديةيُستخدم الذكاء الاصطناعي أيضاً في تحليل سجلات الأمان الضخمة باستخدام تقنيات تعلم الآلة لاكتشاف أي شذوذ أو خروقات أمنية حتى وإن لم تكن هناك توقيعات تهديد معروفة مسبقاً هذا يتيح للشركات القدرة على التصدي للتهديدات المحتملة بشكل أسرع وأكثر فعالية34هذه بذرة مقالة عن الحاسوب أو العاملين في هذا المجال بحاجة للتوسيع فضلًا شارك في تحريرها","score":5
  },
  {
    "title": "حرب سيبرانية",
    "article": "حرب سبيرانية بالإنجليزية Cyberwarfare‏ هي مصطلح يشير إلى استخدام الحواسيب وشبكة الإنترنت في مهاجمة الأعداء وهم يدعون بالمخترقين hackers وهناك منظمات في جميع أنحاء العالم بالطبع ً ليس جميع المخترقين سارقين ففيهم من هو يسمى القرصان أبيض القبعة الهكر الاخلاقي وهو يقوم بالعادة بارجاع المواقع الشخصية وحماية وسد ثغرات الأنظمة هناك جامعات كبرى تدرس هذا العلم بشرط ان يقسم الطالب على عدم استخدامه في الاضرار أو السرقة والجدير بالذكر أن الهكر الاخلاقي يدرس كيف يخترق ويدرس جميع فنون الهكر بالصورة العلمية أي أنه أكثر تطورا ودراية من الهكر الطبيعي واليوم تدور معارك على الشبكة الإنترنت وليس هناك نظام في العالم خال من الثغرات مايكروسوفت تصارع من أجل البقاء ولدى مايكروسوفت فريق من أشهر الهكرز والكراكرز لسد ثغرات الوندوز وهي تقوم شهرياً باصدار ملف لصد فايروسات لايمكن صدها ك سايسبر الذي هو دودة إذا أنتشرت في جهاز الجهاز يعدي أجهزة الشبكة جميعهاوفي النهاية يجب علينا كمستخدمين أن نحرص على عدم حفظ أرقام المصرف في الجهاز ونتزود ببرامج الانتي فايروس ونحرص على تحديثها باستمرار ولكي نتخلص من فايروس سايسر يجب القيام بتحديث نظام التشغيل الخاص بجهازك 123منذ حوالي ربع قرن تغيرت المفاهيم وتنوعت القضايا التي تهم المواطنين العاديين والمثقفين والساسة وأصحاب القرار نتيجة لتغيرات وتطورات كبيرة وسريعة في تقنية نقل وإنتاج وتخزين صناعة المعلومات نتج عنها تحول كبير في الثقافات وشتى أساليب الحياة وتحول العالم برمته إلى قرية صغيرة منفتحة ومتواصلة وأصبحت المعلومات في متناول الجميع وانتقلت ساحات الحروب والمشاحنات وما يحصل فيها من تعديات وظلم وقهر وإذلال للإنسانية بجميع فئاتها وأجناسها وأعمارها إلى صالات المعيشة في كل بيت وفي كل بقعة من العالم في صور حية تُبث في معظم الحالات فور حدوثها فالمشاهد الحية التي يمكن متابعتها من فلسطين المحتلة أو العراق أو سجون أبو غريب وسجن دلتا في جوانتنامو وكثيراً مما شابهها من المناظر المزعجة التي كثيراً ما تغيبها السياسة ويعتم عليها المعتدون أصبحت بفضل الانفتاح الهائل الذي حققته تقنية صناعة المعلومات في متناول الجميع في لحظة وقوعها ومثل هذه الصور والمناظر أثارت النفوس وتنمي الحقد والكراهية لدى من يشاهدهاسهَّل التطور التقني سبل الاتصال والتراسل بين جميع فئات المجتمعات فتشكلت مجاميع ومنظمات  تعتمد على ما توفره وتسهله التقنية الحديثة  تعمل في شتى مجالات الخير والشر بعضها منظمات خيرية تهدف للصالح العام وتحرير الشعوب بطرق سلمية وأخرى مهنية تهتم بحقول مختلفة من حقول العلم والتقنية والطب يتبادل أعضاؤها المعلومات ونتائج البحوث والدراساتأما البعض الآخر فهو منظمات الشر والإرهاب التي تعمل على نشر فكرة أو قضية ترى أنها عادلة حسب مفاهيم المنظمين والمنظرين لها وقد تكون بالفعل كذلك بصرف النظر عن مشروعية أساليبها التي قد تنحو منحىً غير إنساني وإجرامي حيث أنها تكافح لاستعادة حق ضائع أو رد اعتداء من دولة أو عصابة أو منظمات أخرى فتجد من يتعاطف معها ويدعمها بجميع مستويات الدعم عندها تبدأ في تجنيد المحاربين وتدريبهم وبث روح الحماس فيهم وتنظيمهم لينفذوا مهام متعددة الأشكال والنتائج لإرهاب أعدائهم دون الاهتمام بمن سيكون ضمن ضحاياهم من الأبرياءاختلف المفكرون والساسة ورجال الدين في تعريف هذه المنظمات فهي في نظر البعض دعاة لتحرير الأرض ورد الظلم واستعادة الحقوق وفي نظر الآخرين إرهابيون يهدفون إلى تدمير الحضارة الحديثة وقتل وإرهاب من لا يقر بادعاءاتهم ومما يؤسف له أن جميع هذه المنظمات تجد من يستمع لها ويتعاطف معها بل تجد من يضحي بنفسه في سبيل تحقيق ما آمن به وسيستمر ذلك طالما أن هناك عدواناً واحتلالاً للشعوب وانتشار الفساد بين البشر واغتصاب المال العام دون وجه حق وتفشي الظلم وفقدان العدلومهما كانت الأسباب والتعريفات والمعتقدات فحقيقة الأمر أن البنية التحتية العالمية مهددة والاختراقات والعبث بالمعلومات المخزنة أو المتداولة من خلال شبكات الاتصال في تزايد مستمر لأهداف ومسببات شتىأدى ظهور الإنترنت كمجال حربي إلى بذل جهود لتحديد كيفية استخدام الفضاء الإلكتروني لتعزيز السلام على سبيل المثال تدير لجنة الحقوق المدنية الألمانية FIfF حملة من أجل السلام السيبراني للسيطرة على الأسلحة السيبرانية وتقنية المراقبة وضد عسكرة الفضاء السيبراني وتطوير وتخزين المآثر الهجومية والبرامج الضارة4 تشمل تدابير السلام الإلكتروني صانعي السياسات الذين يطورون قواعد ومعايير جديدة للحرب ويقوم الأفراد والمنظمات ببناء أدوات جديدة وبنى تحتية آمنة وتعزيز المصادر المفتوحة وإنشاء مراكز الأمن السيبراني ومراجعة الأمن السيبراني للبنية التحتية الحيوية والالتزامات بالكشف عن نقاط الضعف ونزع السلاح واستراتيجيات الأمن الدفاعية واللامركزية والتعليم والتطبيق الواسع للأدوات والبنى التحتية ذات الصلة والتشفير والدفاعات الإلكترونية الأخرى56تمت أيضًا دراسة موضوعات حفظ السلام عبر الإنترنت وصنع السلام عبر الإنترنت من قبل الباحثين78 كطريقة لاستعادة وتعزيز السلام في أعقاب كل من الحرب الإلكترونية والحرب التقليدية9في أكتوبر 2011 نشرت مجلة الدراسات الإستراتيجية وهي مجلة رائدة في هذا المجال مقالًا بقلم توماس ريد بعنوان الحرب الإلكترونية لن تأخذ مكانها والذي جادل فيه بأن جميع الهجمات الإلكترونية ذات الدوافع السياسية هي مجرد نسخ متطورة من التخريب أو التجسس أو التخريب  وأنه من غير المحتمل أن تحدث حرب إلكترونية في المستقبل10","score":7
  },
  {
    "title": "جريمة سيبرانية",
    "article": "الجريمة السيبرانية بالإنجليزية Cybercrime‏ تشير إلى أي جريمة تتضمن الحاسوب أو الشبكات الحاسوبية قد يستخدم الحاسوب في ارتكاب الجريمة وقد يكون هو الهدف ويمكن تعريف الجريمة الإلكترونية على أنها أي مخالفة ترتكب ضد أفراد أو جماعات بدافع جرمي ونية الإساءة لسمعة الضحية أو لجسدها أو عقليتها سواءً كان ذلك بطريقة مباشرة أو غير مباشرة وأن يتم ذلك باستخدام وسائل الاتصالات الحديثة مثل الإنترنت غرف الدردشة البريد الإلكتروني أو المجموعاتتشهد التقنية والتكنولوجيا تطورات كثيرة واستحداث لأمور جديدة هذا الامر ينذر بتطور أدوات وسبل الجريمة الإلكترونية بشكل أكثر تعقيدا أو أشد ضررا من قبل الأمر الذي يلزم الدول لتطوير آليات مكافحة هذه الجرائم واستحداث خطوط دفاع وسن قوانين وتوعية الناس بمستحدثات هذه الجرائم وتشجيعهم للإبلاغ عنهاهي كل سلوك غير قانوني يتم باستخدام الأجهزة الإلكترونية ينتج عنها حصول المجرم على فوائد مادية أو معنوية مع تحميل الضحية خسارة مقابلة وغالبا ما يكون هدف هذه الجرائم هو القرصنة من أجل سرقة أو إتلاف المعلوماتتمتد من شيوع استخدام الحاسب الآلي في الستينات إلى غاية 1970 اقتضت معالجة على المقالات تمثلت في التلاعب بالبيانات المخزنة وتدميرهافي الثمانينات حيث طفح على السطوح مفهوم جديد لجرائم الكمبيوتر والإنترنت تمثلت في اقتحام الأنظمة ونشر الفيروساتفي التسعينات حيث شهدت هذه المرحلة تناميا هائلا في حقل الجرائم الإلكترونية نظرا لانتشار الإنترنت في هذه الفترة مما سهل من عمليات دخول الأنظمة واقتحام شبكة المعلومات مثلا تعطيل نظام تقني نشر الفيروساتالخوفي 8 أغسطس 2024 اعتمدت الدول الأعضاء في الأمم المتحدة معاهدة لمكافحة الجرائم السيبرانية تُعد أول نص من نوعه تقره المنظمة الأممية في هذا الشأن1وصلت الجرائم الإلكترونية إلى حد القتل ففي شهر 9 من عام 2020 توفيت امرأة في دوسلدورف في أحد المستشفيات الألمانية بعد تعطل نظام الحاسوب بسبب برنامج للقرصنة بواسطة الفدية وهو برنامج خبيث يقيد الوصول إلى نظام الحاسوب الذي يصيبه ويعكس هذا الهجوم الإلكتروني مدى هشاشة القطاع الصحي في مواجهة هذه الهجمات وقال الكاتب أنوش سيدتاغيا في تقرير نشرته صحيفة لوتون le temps السويسرية إنه لم يحدث أن سُجلت حالات وفاة نتيجة هجوم إلكتروني ولكن تسبب هجوم سيبراني في وفاة مريضة في مستشفى بدوسلدورف نتيجة عدم تلقيها للعلاج وأعلنت السلطات الألمانية عن العواقب المأساوية للهجوم السيبراني «الإلكتروني» الذي استهدف الشبكة الإلكترونية للمستشفى الجامعي في دوسلدورف ليصيب أنظمته بالشلل الجزئي منذ 9 سبتمبرأيلول2وبرنامج الفدية المعروف باسم «رانسوم وير» هو برنامج ضار يستهدف نقاط الضعف في برامج معينة للسماح للمهاجمين بالتحكم عن بُعد في أنظمة الحاسوب ومقابل إعادة الوصول إلى الملفات المحملة على أجهزة الحاسوب عادة ما يطلب المخترق فدية تصل إلى عشرات أو حتى مئات الآلاف من الفرنكات2","score":6
  },
  {
    "title": "التقاط العلم (أمن سيبراني)",
    "article": "التقاط العلم CTF في أمن الكمبيوتر هو تمرين يحاول فيه المشاركون العثور على سلاسل نصية تسمى الأعلام والتي يتم إخفاؤها سراً في البرامج أو المواقع الإلكترونية المعرضة للخطر عمداً تستخدم لأغراض تنافسية وتعليمية 1 يمكن أن تتضمن المسابقات إخفاء الأعلام في الأجهزة ويمكن أن تكون عبر الإنترنت أو شخصيًا ويمكن أن تكون على مستوى متقدم أو مبتدئ اسم اللعبة مستوحى من أمسك العلم الواقعية تُستخدم تحديات التقاط العلم كأداة لتطوير وتحسين مهارات الأمن السيبراني مما يجعلها شائعة في البيئات المهنية والأكاديمية قد يكون هناك نوعان رئيسيان من التحديات يقوم المشاركون إما بسرقة الأعلام من المشاركين الآخرين نمط الهجومالدفاع أو من المنظمين نمط المخاطرةالتقاط العلم CTF مسابقة للأمن السيبراني تستخدم لاختبار وتطوير مهارات أمن الكمبيوتر تم تطويره لأول مرة في عام 1996 في ديف كون  أكبر مؤتمر للأمن السيبراني في الولايات المتحدة والذي يقام سنويًا في لاس فيجاس  نيفادا 2 ويستضيف في عطلة نهاية الأسبوع مسابقات تشمل التقاط العلمهناك نوعان رئيسيان من تحديات CTF وهما نماذج الخطر والهجوم والدفاع يختبر كلا النوعين معرفة المشاركين في مجال الأمن السيبراني لكنهما يختلفان في الأهداف في نموذج Jeopardy يتوجب على الفرق المشاركة حل أكبر عدد ممكن من التحديات التي تتنوع في نقاطها من فئات مختلفة مثل التشفير واستغلال الويب والهندسة العكسية أما في نموذج الهجوم والدفاع فيتنافس الفرق على حماية أنظمتها الضعيفة بينما تهاجم أنظمة الفرق المنافسةيتضمن التمرين مجموعة متنوعة من المهام بما في ذلك استغلال وكسر كلمات المرور ولكن هناك أدلة محدودة توضح كيفية ترجمة هذه المهام إلى معرفة يمتلكها خبراء الأمن في مجال الأمن السيبراني أظهرت الأبحاث الحديثة أن مهام الاستيلاء على العلم تركزت بشكل أساسي على المعرفة التقنية لكنها تفتقر إلى تناول الموضوعات الاجتماعية مثل الهندسة الاجتماعية والتوعية بالأمن السيبرانيثبت أن التقاط العلم طريقة فعالة لتعلم الأمن السيبراني باللعب 3 هناك العديد من الأمثلة على CTFs المصممة لتعليم مهارات الأمن السيبراني لمجموعة واسعة من الجماهير بما في ذلك PicoCTF التي نظمتها Carnegie Mellon CyLab  والتي تستهدف طلاب المدارس الثانوية وجامعة ولاية أريزونا المدعومة pwncollege 4 5 6 إلى جانب الأحداث والموارد التعليمية التي تنظمها CTF فقد ثبت أن CTFs هي طريقة فعالة للغاية لغرس مفاهيم الأمن السيبراني في الفصل الدراسي 7 8 في فصول علوم الكمبيوتر الجامعية مثل مقدمة لأمن المعلومات في الجامعة الوطنية في سنغافورة  9 تحظى فرق التدريب القتالي بشعبية كبيرة في الأكاديميات العسكرية وغالبًا ما تُدرج كجزء من المناهج الدراسية لدورات الأمن السيبراني قامت وكالة الأمن القومي بتنظيم تمرين سيبراني culminated في مسابقة CTF بين الأكاديميات العسكرية الأمريكية والكليات العسكرية10يقوم العديد من منظمي CTF بتسجيل مسابقاتهم على منصة CTFtime مما يتيح تتبع أداء الفرق على مدار الوقت وعبر المسابقات تشمل الفرق الشهيرة برلمان بلايد أوف بونينج والمزيد من دجاج ليت المدخن وقطاع التنين ودي سي يو إيه وتناول الطعام والنوم والبون والتكرار والأزرق المثالي والمنظمون والمياه الزرقاء بشكل عام حققت كل من برلمان بلايد للرماية وقطاع التنين المركز الأول عالميًا ثلاث مرات لكل منهماتُنظم العديد من فرق العمل المجتمعية سنويًا في أشكال متنوعة ترتبط العديد من تحديات CTF بمؤتمرات الأمن السيبراني مثل DEF CON وHITCON وBSides تُعتبر بطولة DEF CON CTF التي تجمع بين الهجوم والدفاع واحدة من أقدم بطولات CTF على الإطلاق وقد أُشير إليها بعبارات مختلفة مثل سلسلة العالم والسوبر بول والألعاب الأولمبية بسبب تغطيتها الإعلامية الواسعة استضافت جامعة نيويورك تاندون مسابقة التوعية بالأمن السيبراني العالمية CSAW التي تُعد من أكبر المسابقات المفتوحة للطلاب المهتمين بالأمن السيبراني من جميع أنحاء العالم في عام 2021 شارك أكثر من 1200 فريق خلال الجولة التأهيليةتقوم العديد من أندية وفرق CTF بتنظيم مسابقات CTF يرتبط العديد من هذه الأندية بالجامعات مثل Plaid Parliament of Pwning المرتبطة بجامعة CMU والتي تستضيف مسابقة PlaidCTF وShellphish المرتبطة بجامعة ولاية أريزوناتتضمن مسابقات CTF المدعومة من الحكومة تحدي DARPA Cyber Grand Challenge وتحدي الأمن السيبراني الأوروبي ENISA في عام 2023 شملت مسابقة HackaSat CTF التي ترعاها قوة الفضاء الأمريكية ولأول مرة قمرًا صناعيًا مداريًا حيًا يمكن استغلاله من قبل المشاركينتستخدم الشركات والمنظمات في بعض الأحيان أدوات التقييم والاختبار كوسيلة للتدريب أو التقييم فوائد أدوات التعلم التعاوني مشابهة لتلك التي تتواجد في البيئات التعليمية بالإضافة إلى تمارين CTF الداخلية تستضيف بعض الشركات مثل Google وTencent مسابقات CTF يمكن الوصول إليها علنًا","score":8
  },
  {
    "title": "أكاديمية طويق",
    "article": "أكاديمية طويق هي مؤسسة تعليمية مقرّها مدينة الرياض أعلن الاتحاد السعودي للأمن السيبراني والبرمجة و الدرونز عن تأسيسها في أغسطس 2019 وتتخذ من جامعة الأميرة نورة بنت عبد الرحمن مقرًا لها2 تُعد الأكاديمية الأولى للتقنيات المتقدمة في المملكة العربية السعودية من خلال تقديم مستوى عال من البرامج التدريبية على التقنية المتقدمة والمعسكرات في البرمجة وهندسة البرمجيات وعلوم البيانات والأمن السيبرانيتسعى نحو تقليص الفجوة بين متطلبات سوق العمل ومهارات الأفراد في مجالات تقنية المعلومات بالتركيز على بناء القدرات وتقديم خبرات جديدة وتطوير المهارات تعمل على تزويد سوق العمل بمحترفين رقميين يسعون للحصول على وظائف بمجال التقنية في الشركات345في 15 يوليو 2024م أعلنت أكاديمية طويق عن إطلاق هويتها الجديدة وتعبر الهوية عن قمة جبل طويق وتعكس الركائز الثلاث للأكاديمية تعلّم بلا توقف تعلّم مبني على احتياجات سوق العمل تعلّم قائم على التطبيق العملي6قاد الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز بعدة شراكات إستراتيجية ممثلة بأكاديمية طويق وجامعة الأميرة نورة بنت عبد الرحمن مع عدد من الشركات العالمية التقنية وذلك بإنشاء أكاديميات متخصصة ومتقدمة في السعودية والتي ستلعب دورًا بارزًا في تلبية الطلب في السوق المحلي من الكوادر التقنية في مختلف المجالات على أعلى مستوى من التأهيل وبشهادات معتمدة وقد أعلن عن عقد هذه الشراكات في حدثLaunchKSA7 وتمثل ذلك بعقد شراكات مع كل من أبل8 سيسكو9 أمازون لخدمات الويب10 علي بابا كلاود11 أوراكل12 أي بي أم13 مايكروسوفت14 وشركة Offensive Security15 وشركة Trend Micro16وقد أفتحت أولى الأكاديميات أكاديمية مطوري أبل Apple Developer Academy وخصصت للنساء كمرحلة أولى بهدف تمكين المرأة وزيادة معدلات توظيفها ومشاركتها في سوق العمل817وفي لقاء لفيصل الخميسي رئيس مجلس إدارة الاتحاد السعودي للأمن السيبراني والبرمجة و الدرونز على برنامج بودكاست فنجان صرح فيه أن أحد الأهداف من هذه الشراكات هي إنشاء مراكز أبحاث إقليمية لتلك الشركات في السعودية18اختارت شركة أبل العاصمة الرياض مقرًا لأكاديميتها أكاديمية مطوري آبل Apple Developer Academy لتُصبح المملكة الأولى في منطقة الشرق الأوسط وشمال إفريقيا في تأسيس هذه الأكاديمية التي ستُخصص في مرحلتها الأولى للمبرمجات والمطورات دعمًا لجهود تمكين المرأة والإصلاحات الاجتماعية الضخمة لرؤية 2030817في 25 يوليو 2022م أُعلن عن تنظيم معرض التوظيف والاستثمار بمقر أكاديمية أبل في الرياض بحضور أكثر من 60 شركة1920دورات تدريبية في البرمجة والتصميم والتقنيات الحديثة تهدف لمساعدة المتدربين الناشئين على اكتشاف اهتماماتهم التقنيةمعكسرات برمجية تستهدف الشباب وخريجي الجامعات لتعلم وإتقان مهارات برمجية متقدمة في فترة تتراوح بين عدة أسابيع إلى عدة أشهردورات لتعليم مهارات تقنية في مدة قصيرة مع تقديم شهادة بعدد ساعات التدريبلقاء تقني يتم بثه على منصات التواصل الإجتماعي التابعة للأكاديمية يتناول مواضيع تقنيةلقاءات أسبوعية تحدث في مقر الأكاديمية بالرياض بشكل حضوري تتناول نقاشات تقنية مع أبرز الخبراء في المجالأطلقت الأكاديمية منصة سطر منصة طويق التعليمية سابقًا تحت شعار «أول منصة عربية متخصصة في مجالات التقنية الحديثة باللغة العربية»21 وهي منصة تعليمية إلكترونية تحوي دروسًا تفاعلية مُسجلة لعدة مجالات منها تطوير الويب وتطوير تطبيقات الهواتف المحمولةتهدف المنصة إلى إثراء المحتوى العربي في مجال تعليم البرمجة22 والإختبارات والتحديات في مجال البرمجة23الويبتطبيقات الهواتف المحمولةتوفر المنصة إمكانية التقديم لإجراء اختبارات من أجل الحصول على شهادة إعتماد وذلك من خلال منصة الإعتماد في سطر ويتم إضافة الشهادة إلى ملفاتهم الشخصية في المنصةهي منصة مقدمة من الأتحاد السعودي للأمن السيبراني والبرمجة والدرونز بالتعاون مع الأكاديمية من خلال منصة سطر تحت شعار «أول منصة عربية متخصصة في التحديات البرمجية»24 وتهدف إلى وضع تحديات برمجية تمكن المتدربين في المنصة من اختبار قدراتهم البرمجية ومستوى تعلمهم من خلال حل تحديات برمجية متعددة ومختلفة في مستوى الصعوبة وعند حل التحديات يتم إضافة شارة إلى ملفاتهم الشخصية في المنصةبعد إنطلاق معسكر طويق 1000 أنشئت الأكاديمية منصة رسمية كوسيلة إعلان رسمية للفعاليات البرمجية والسيبرانية التي يوفرها الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز بالشراكة مع أكاديمية طويقتهدف الأكاديمية إلى إنشاء مجتمعات تقنية من خلال منصة سطر التعليمية21 والتي تسمح للأعضاء في الدخول في مجتمعات برمجية مُختلفة على تيليجرام بحسب اللغة والمجال البرمجي للإستفسار وتبادل المعرفة والخبرة وحل المشاكل ولدى المنصة أكثر من 10 آلاف عضو في مجتمعاتها","score":3
  },
  {
    "title": "أمن قومي",
    "article": "تعديل  تعديل مصدري  تعديل ويكي بياناتالأمن القومي هو مفهوم حماية الحكومة والبرلمان للدولة والمواطنين عبر سياسات فرض السلطة سواء كانت سياسية اقتصادية دبلوماسية وعسكرية123 تطور المفهوم والمصطلح في الولايات المتحدة عقب الحرب العالمية الثانية مع تركيز شديد على القوة العسكرية إلا أن مفهوم الأمن القومي يشمل مجموعة واسعة من التحديات التي تؤثر على الأمن غير العسكري أو الاقتصادي للدولة من أجل سلامة الأمن القومي تحتاج الأمة للأمن الاقتصادي وأمن الطاقة والأمن البيئي تحديات الأمن القومي ليست حكراً على خصوم تقليديين من دول قومية أخرى بل من الجهات الفاعلة غير الحكومية مثل المسؤلين الفاسدين عصابات المخدرات والشركات متعددة الجنسيات والمنظمات غير الحكومية وتشمل بعض التحديات الكوارث والأحداث الطبيعيةتشمل الأسباب المحتملة لغياب الأمن القومي تصرفات كل من الدول الأخرى كالهجمات العسكرية أو الإلكترونية والجهات الفاعلة غير الحكومية العنيفة كالهجمات الإرهابية والجماعات الإجرامية المنظمة مثل عصابات المخدرات وكذلك آثار الكوارث الطبيعية كالفيضانات والزلازل تشمل العوامل المنظومية المؤدية إلى انعدام الأمن التي قد تكون عبر وطنية تغير المناخ و التفاوت الاقتصادي والتهميش  والاستبعاد السياسي و العسكرة 45لأمن الدولة القومية بالنظر إلى مجموعة واسعة من المخاطر عدة أبعاد من بينها الأمن الاقتصادي وأمن الطاقة والأمن المادي والأمن البيئي والأمن الغذائي وأمن الحدود والأمن الإلكتروني ترتبط هذه الأبعاد ارتباطًا وثيقًا بعناصر القوة القوميةتنظم الحكومات بشكل متزايد سياساتها الأمنية في إطار إستراتيجية أمنية قومية وقد أصبحت إسبانيا والسويد والمملكة المتحدة والولايات المتحدة اعتبارًا من عام 2017 من بين الدول التي فعلت ذلك تعين بعض الدول كذلك مجلسًا للأمن القومي ومستشارًا للأمن القومي أحيانًا وهو هيئة حكومية تنفيذية يمد رئيس الدولة بالمواضيع المتعلقة بالأمن القومي والمصلحة الاستراتيجية يضع مجلس الأمن القومي ومستشار الأمن القومي الخطط على المدى الطويل والقصير وخطط الطوارئ الأمنية القومية لدى الهند أحد هذه الأنظمة في الوقت الراهن وقد أُنشئ في 19 نوفمبر 199867رغم اختلاف الدول في نهجها حيث بدأ بعضها يعطي الأولوية للعمل غير العسكري من أجل التصدي للعوامل المنظومية المؤدية إلى انعدام الأمن فإن مختلف أشكال القوة القسرية هي التي تسود ولا سيما القوة العسكرية لا يزال حجم هذه القوة يتطور كانت القدرات العسكرية على نحو تقليدي برية أو بحرية ولا تزال كذلك في البلدان الأصغر حجمًا تشمل الآن مجالات الحرب المحتملة في بلدان أخرى الجو والفضاء والفضاء الإلكتروني والحرب النفسية يمكن استخدام القدرات العسكرية المصممة لهذه المجالات لأغراض الأمن الوطني أو بالمثل لأغراض هجومية كاحتلال وضم الأراضي والموارد8هذه بذرة مقالة عن مواضيع أو أحداث أو شخصيات أو مصطلحات سياسية بحاجة للتوسيع فضلًا شارك في تحريرهاهذه بذرة مقالة عن حروب أو معارك بحاجة للتوسيع فضلًا شارك في تحريرها","score":0
  },
  {
    "title": "المنتدى الدولي للأمن السيبراني",
    "article": "تعديل  تعديل مصدري  تعديل ويكي بياناتالمنتدى الدولي للأمن السيبراني هو منصة عالمية تتناول موضوعات الأمن السيبراني وبناء أسس التعاون تنظمه الهيئة الوطنية للأمن السيبراني في المملكة العربية السعودية وكان انعقاد الدورة الأولى بالتزامن مع رئاسة المملكة لمجموعة العشرين ويمثل المنتدى منصة تفاعلية عالمية لكافة المعنيين والمختصين بمجال الأمن السيبراني من ممثلي القطاعات الحكومية والخاصة والمنظمات غير الربحية والأوساط التعليمية والأكاديمية حول العالم بهدف نقل المعرفة حول موضوعات الأمن السيبراني وبناء أسس التعاون بين الدول والمنظمات ليصبح قطاع الأمن السيبراني عنصراً ممكّناً في مواجهة التحديات المستقبلية وصناعة التنمية الاقتصادية والاجتماعية في السعودية وحول العالم1عقدت الهيئة المنتدى الدولي للأمن السيبراني في دورته الأولى خلال الفترة 4 5 فبراير 2020 في مدينة الرياض تحت شعار تضافر الجهود نحو عالم سيبراني أفضل وجاء عقد المؤتمر تزامناً مع رئاسة السعودية لمجموعة العشرين وقد شهد المنتدى مشاركة 147 متحدثاً من داخل المملكة وخارجها كما تجاوز عدد الحضور 3500 مشارك وقد شهد المنتدى مناقشة مجموعة محاور تمثلت فيما يلينظمت الهيئة الوطنية للأمن السيبراني حوارا افتراضيا جمع كبار المسؤولين حول العالم المعنيين بالأمن السيبراني وأقيم الحوار في 7 أبريل 2021 تحت شعار واقع الفضاء السيبراني اليوم وغدًا وقد جاء تنظيم هذا الحوار بالتزامن مع التهديدات السيبرانية التي تواجه العالم بشكل مستمر وركز الحوار الافتراضي على محورين أساسيين وهمانظمت الهيئة الوطنية للأمن السيبراني النسخة الثانية من المنتدى الدولي للأمن السيبراني تحت شعار إعادة التفكير في الترتيبات السيبرانية العالمية يومي 9 و10 نوفمبر 2022 في العاصمة الرياض بمشاركة نخبة من صناع القرار والرؤساء التنفيذيين وكبار المسؤولين الحكوميين وممثلي أبرز الشركات العالمية والمنظمات غير الحكومية والأوساط الأكاديمية من حول العالم لمناقشة القضايا الإستراتيجية وفرص التعاون بين الشركاء الدوليين في مجال الأمن السيبراني وشهد المنتدى انعقاد أكثر من 30 جلسة حوارية تناولت مجموعة من الموضوعات التي ناقشت آفاق التغيير في المشهد السيبراني والاقتصادات السيبرانية والتطور الجيوسيبراني ومستقبل العمل السيبراني والأمن السيبراني للجميع وتطرق المنتدى إلى أهمية التعاون الدولي وبحث الحلول العملية لسد الفجوة السيبرانية عالمياً واستكشاف مستقبل الأمن السيبراني وضمان تحقيق الأمن السيبراني لجميع المجتمعاتوناقشت جلسات المنتدى خمسة محاور رئيسة هي","score":5
  },
  {
    "title": "وكالة الأمن السيبراني وأمن البنية التحتية",
    "article": "تأسست وكالة الأمن السيبراني وأمن البنية التحتية بالإنجليزية Cybersecurity and Infrastructure Security Agency‏ وتعرف اختصارا CISA في 16 نوفمبر 2018 عندما وقع الرئيس دونالد ترامب قانون وكالة الأمن السيبراني وأمن البنية التحتية لعام 2018 ليصبح قانونًا34 وكالة الأمن السيبراني وأمن البنية التحتية هي وكالة فدرالية مستقلة في الولايات المتحدة تحت إشراف وزارة الأمن الداخلي DHS4 أفادت صحيفة ديلي بيست في فبراير 2019 أن اثنين من فرق العمل تم تقليص حجمهما بشكل كبير5أنشطتها هي استمرار للمديرية الوطنية للحماية والبرامج NPPD وهو برنامج أنشئ في عام 2007 داخل وزارة الأمن الوطني تشرف وكالة الأمن السيبراني وأمن البنية التحتية على6كريستوفر كريبس وكيل الأمين السابق للحزب الوطني الديمقراطي من أجل الديمقراطية هو أول مدير لوكالة الأمن السيبراني وأمن البنية التحتية وماثيو ترافيس هو أول نائب له78 يتمثل الدور المتوقع لوكالة الأمن السيبراني وأمن البنية التحتية في تحسين الأمن السيبراني عبر جميع مستويات الحكومة وتنسيق برامج الأمن السيبراني مع الولايات وتحسين حماية الحكومة للأمن السيبراني ضد المتسللين من الدول والأفراد4في 22 كانون الثاني يناير 2019 أصدرت وكالة الأمن السيبراني وأمن البنية التحتية أول توجيه لحالات الطوارئ Mitigate DNS Infrastructure Tampering 1901 9 تحذيرًا من أن «مهاجمًا نشطًا يستهدف المنظمات الحكومية» باستخدام تقنيات انتحال أسماء النطاقات لأداء هجمات الوسطاء10 صرحت مجموعة الأبحاث FireEye أن «الأبحاث الأولية تشير إلى أن الممثل أو الجهات الفاعلة المسؤولة لها صلة بإيران»11","score":5
  },
  {
    "title": "فيصل الخميسي",
    "article": "فيصل الخميسي رئيس مجلس إدارة الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز ورجل أعمال رائد في مجال التقنية خبرة لأكثر من 20 عاما في مجال تقنية المعلومات مع اهتمام خاص بتطبيقات الموبايل والذكاء الصناعي رئيس شركة موزلت Pte Mozat Ltd والتي تعد واحدة من أكبر شركات تطبيقات الموبايل في شرق آسيا والتي يعمل فيها أكثر من 200 مهندس نظم في سنغافورة بالإضافة للرياض والصين وهي مصنفة من ضمن أكبر 10 شركات في منطقة الشرق الأوسط لكل من2 يعد الخميسي من أول السعوديين والعرب تغريداً في تويتر3ترأس فيصل خميسي منصب رئيس مجلس إدارة الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز في السابع من يناير 2018 كما ترأس منصب رئيس مجلس إدارة الشركة السعودية للحوسبة السحابية في الخامس من يونيو 2022هذه بذرة مقالة عن حياة شخصية سعودية بحاجة للتوسيع فضلًا شارك في تحريرها","score":0
  },
  {
    "title": "خالد عبد الله السبتي",
    "article": "خالد بن عبد الله السبتي رئيس مجلس إدارة هيئة تقويم التعليم والتدريب في السعودية منذ عام 2021م1 ومستشار في الأمانة العامة لمجلس الوزراء السعودي بمرتبة وزير2 ويشغل حاليًا عضوية عدد من المجالس واللجان منها مجلس شؤون الجامعات السعودي3 وبرنامج بناء القدرات البشرية أحد برامج رؤية السعودية 20304 ومجلس إدارة مدارس مسك ومجلس أمناء جامعة الملك عبدالله للعلوم والتقنية ومجلس أمناء جامعة نايف العربية للعلوم الأمنية وهيئة جائزة الملك فيصل56وخلال مسيرته العملية تولى الدكتور خالد السبتي عدة مناصب منها محافظًا للهيئة الوطنية للأمن السيبراني ووزيرًا للتعليم العالي وزارة التعليم حاليًا وذلك عام 2014م ونائبًا لوزير التربية والتعليم بمرتبة وزير وعضوًا في مجلس الشورى السعودي إلى جانب عضوية عدد من المجالس ورئاسة لجان حكومية وخاصة وخيرية789حصل السبتي على شهادة البكالوريوس في علوم الحاسب من جامعة الملك سعود مع مرتبة الشرف الأولى في عام 1991م إضافة إلى حصوله على الدكتوراه والماجستير في علوم الحاسب من جامعة سيركيوز بأمريكا في عامي 1994 و1998م وعمل مطلع حياته الوظيفية عضوًا في هيئة التدريس في قسم علوم الحاسب الآلي بجامعة الملك سعود10خلال مسيرته التعلمية عمل الدكتور خالد السبتي مساعد أستاذ في قسم علوم الحاسب في جامعة سيركيوز بأمريكا عام 1994م واكتسب العديد من الخبرات خلال عمله في بعض الشركات الدولية مثل شركة نياقراموهاك عام 1994 بنيويورك وشركة أي بي أم في نيويورك في الولايات المتحدة الأمريكية عام 1996 وشركة هيتاشي أمريكا في عام 1997 إلى جانب عمله في وادي السليكونوعلى المستوى التدريبي حصل السبتي على عدة دورات تدريبية منها برنامج التطوير السريع للمديرين التنفيذيين بكلية لندن للأعمال وشارك في برنامج إدارة الشراكات والاتحادات الإستراتيجية بجامعة إنسياد في فرنسا كما شارك في برنامج مجالس الإدارة ذات الكفاءة العالية بجامعة أم أي دي في سويسرا9شغل الدكتور خالد السبتي العديد من المناصب وهي وزير للتعليم العالي11 ومحافظ الهيئة الوطنية للأمن السيبراني ورئيس هيئة تقويم التعليم ونائبا لوزير التربية والتعليم ونائبا لوزير التربية والتعليم لتعليم البنين كما كان عضوًا في مجلس الشورى السعودي وتولى منصب الأمين العام لمؤسسة الملك عبد العزيز ورجاله للموهبة والإبداع موهبةكما شغل عضوية عدد من المجالس ورئاسة لجان حكومية وخاصة وخيرية ومن ذلك عضوية مجلس أمناء دارة الملك عبدالعزيز ومجلس أمناء مؤسسة الملك عبدالعزيز ورجاله للموهبة والإبداع ومجلس إدارة واحة الملك سلمان للعلوم وعضويتي لجنتي الاقتصاد والطاقة والشؤون الخارجية في مجلس الشورى ومجلس إدارة المؤسسة العامة للتدريب التقني والمهني ومجلس أمناء مؤسسة تكافل الخيرية لطلبة التعليم العام والمجلس التنفيذي لمكتب التربية العربي لدول الخليج ومجلس إدارة الشركة السعودية للكهرباء ومجلس الإدارة في جمعية الحاسبات السعوديةومن المناصب التي تقلدها عمله مديرًا عامًا لبرنامج التعاملات الإلكترونية الحكومية يسر حيث قاد تأسيس البرنامج كما كان مستشاراً لوزير الاتصالات وتقنية المعلومات في مجال تقنية المعلومات وأدار مشروع الخطة الوطنية الأولى لتقنية المعلومات وتولى رئاسة مجلس إدارة شركة تطوير التعليم القابضة ورئاسة مجلس المديرين لشركة الخدمات التعليمية ورئاسة مجلس المديرين لشركة النقل التعليمي وقد قاد وشارك في تأسيس وتحويل ونمو عدد من الجهات الحكومية والشركات والجهات غير الهادفة للربح إضافة إلى قيادته ومشاركته في إعداد وتنفيذ العديد من الخطط والبرامج في مجالات مختلفة كما رأس وشارك في العديد من الوفود الرسمية وحضر وساهم في عدة مؤتمرات ومنتديات محلية ودولية10تقلد خالد السبتي نظير خبراته وقدراته وشاح الملك عبدالعزيز من الطبقة الثانية عام 2021 كما نال وسام الملك عبد العزيز من الدرجة الأولى عام 2004م لتميزه في تطوير الحركة العلمية وحركة البحث العلمي المميز كما حصل على ميدالية التميز من جامعة الملك سعود في عام 1428ه وحصل على براءتي اختراع في مجال تقنية المعلومات تعدين البيانات من مكتب براءات الاختراع الأمريكية عام 1999م وتشمل هذه الخبرات مجالات تقنية المعلومات بما في ذلك الحكومة الإلكترونية وتعدين البيانات الكبيرة والتعليم والتدريب والتطوير والابتكار والإبداع والموهبة والاقتصاد المعرفي ومجتمع المعرفة والتخطيط الاستراتيجي وكذلك قيامه بالشراكة مع بعض زملائه بإعداد كتب علمية في مجالات تعدين البيانات واكتشاف المعارف في الولايات المتحدة الأمريكية ونشر العديد من الأبحاث العلمية منفرداً ومع آخرين10يمتلك السبتي خبرات عملية عديدة في مجالات متعددة أبرزها التعليم والابتكار والإبداع والموهبة والبحث العلمي والتطوير وتقنية المعلومات والأمن السيبراني وله خبرة كبيرة في تأسيس ونمو القطاعات والجهات الحكومية والشركات والجهات غير الهادفة للربح فقد قاد وشارك في إعداد وتنفيذ العديد من الخطط والبرامج في مجالات مختلفة وكان له دور رئيس في تأسيس الهيئة الوطنية للأمن السيبراني وإعداد الإستراتيجية الوطنية الأولى للأمن السيبراني وتأسيس قطاع الأمن السيبراني في المملكة وغيره من الأعمال التي ساهمت في حصول المملكة العربية السعودية على المركز الثاني عالمياً من بين 193 دولة في المؤشر العالمي للأمن السيبراني الصادر من الاتحاد الدولي للاتصالات التابع للأمم المتحدة في عام 2021 كما كانت له مساهمات كبيرة في تطوير الموهبة والإبداع في السعودية حيث أشرف على إعداد وتنفيذ الخطة الوطنية الأولى للموهبة والإبداع في السعودية وساهم بشكل كبير في قطاع تقنية المعلومات والحكومة الإلكترونية حيث أشرف على إعداد الخطة الوطنية التنفيذية الأولى للحكومة الإلكترونية وتأسيس برنامج الحكومية الإلكترونية السعودي يسر وإعداد الخطة الوطنية الأولى لتقنية المعلومات● عضو مجلس إدارة الهيئة الوطنية للأمن السيبراني● عضو اللجنة الوطنية للتحول الرقمي● عضو اللجنة التنفيذية لمجلس ادارة مركز المعلومات الوطني● عضو الفريق المشكل لوضع تصور لمبادرة وطنية للابتكار● رئيس الفريق الاستشاري لأمن المعلومات● نائب رئيس مجلس أمناء جائزة خادم الحرمين الشريفين لتكريم المخترعين والموهوبين● عضو مجلس إدارة الشركة السعودية لتقنية المعلومات● رئيس مجلس إدارة شركة تطوير التعليم القابضة● عضو مجلس إدارة الشركة السعودية للكهرباء● رئيس مجلس المديرين لشركة الخدمات التعليمية● رئيس مجلس المديرين لشركة النقل التعليمي● مدير عام برنامج التعاملات الإلكترونية الحكومية وزارة الاتصالات وتقنية المعلومات 1425ه● رئيس اللجنة التوجيهية للخطة التنفيذية الأولى للحكومة الإلكترونية في السعودية● رئيس فريق إعداد الخطة الوطنية للاتصالات وتقنية المعلومات وزارة الاتصالات وتقنية المعلومات 1426ه● مدير مشروع الخطة الوطنية لتقنية المعلومات 1422ه● رئيس فريق عمل بلورة الاستراتيجية العربية للاتصالات والمعلومات مجلس الوزراء العرب للاتصالات والمعلومات جامعة الدول العربية 1425ه● عضو مجلس إدارة جمعية الحاسبات السعودية 1421ه● عضو هيئة تدريس استاذ مساعد قسم علوم الحاسب جامعة الملك سعود الرياض 1419ه● عضو مجلس مركز البحوث كلية علوم الحاسب والمعلومات جامعة الملك سعود 1421ه● عضو مجلس قسم علوم الحاسب جامعة الملك سعود 1419ه● مشرف على مركز الحاسب كلية علوم الحاسب والمعلومات جامعة الملك سعود الرياض 1419ه● باحث في مجال تعدين البيانات واكتشاف المعارف معمل تقنية المعلومات شركة هيتاشي سيلكون فالي كاليفورنيا الولايات المتحدة الأمريكية 1997م● باحث في مجال تعدين البيانات واكتشاف المعارف مركز أبحاث تي جاي واتسون شركة آي بي ام نيويورك الولايات المتحدة الأمريكية 1996م● مهندس نظم شركة نياقراموهاك نيويورك الولايات المتحدة الأمريكية 1994م● معيد قسم علوم الحاسب جامعة الملك سعود الرياض 1991م● ميدالية جامعة الملك سعود الفضية للتميز في 1428ه 2007م● جائزة سمو الأمير بندر بن سلطان للتفوق العلمي في الولايات المتحدة الأمريكية في 1995م● عضوية شرفية في الجمعية الشرفية للطلاب الدوليين في الولايات المتحدة الأمريكية في PHA DETA DELTA 1994م● بعثة للدراسات العليا إلى الولايات المتحدة الأمريكية جامعة الملك سعود 1992م● مرتبة الشرف الأولى لمرحلة البكالوريوس جامعة الملك سعود 1991م● Khaled AlSabti et al Method and Apparatus for Reducing the Computational Requirements of KMeans Data Clustering United States Patent No 5983224 November 9 1999● Khaled AlSabti et al Structure and Method for Efficient Parallel HighDimensional Similarity Join United States Patent No 5987468 November 16 19991436 ه  1436 ه","score":4
  },
  {
    "title": "المركز الوطني للأمن السيبراني (الكويت)",
    "article": "تعديل  تعديل مصدري  تعديل ويكي بياناتالمركز الوطني للأمن السيبراني جهاز حكومي كويتي يُعنى بالأمن السيبراني في دولة الكويت ووضع الإستراتيجية الوطنية لهذا القطاع لتأمين وحماية الشبكات المعلوماتية وشبكة الاتصالات ونظم المعلومات وعمليات جمع وتبادل المعلومات باستخدام أي وسيلة إلكترونية أسس في 5 فبراير 2022 بمرسوم أميري أصدره نائب الأمير وولي العهد الشيخ مشعل الأحمد الجابر الصباح1 للمركز وزير مشرف يحدده مجلس الوزراء ورئيس معين لرئاسة الجهاز أصدر رئيس مجلس الوزراء الشيخ صباح خالد الحمد الصباح في 12 فبراير 2022 قرارًا بتحديد نائب رئيس مجلس الوزراء وزير الداخلية الشيخ أحمد منصور الأحمد الصباح للإشراف على المركز2هذه بذرة مقالة عن موضوع عن وكالة حكومية كويتية بحاجة للتوسيع فضلًا شارك في تحريرها","score":6
  },
  {
    "title": "موسم الرياض",
    "article": "تعديل  تعديل مصدري  تعديل ويكي بياناتموسم الرياض هو مهرجان ترفيهي عالمي يقام في مدينة الرياض عاصمة المملكة العربية السعودية ويهدف لتحويلها إلى وجهة ترفيهية سياحية عالمية وفقا لأهداف برنامج جودة الحياة أحد برامج رؤية السعودية 2030 انطلق موسم الرياض للمرة الأولى في عام 2019 واستقطب أكثر من 10 ملايين زائر وانطلق موسمه الثاني في 20 أكتوبر 2021 بعد توقفه عام 2020 بسبب جائحة فيروس كورونا1 وانطلق الموسم الثالث في 21 أكتوبر 2022 وحمل شعار «فوق الخيال» ودخل حفل افتتاح موسم الرياض 2022 موسوعة غينيس للأرقام القياسية كأكثر حفل تُطلق فيه الألعاب النارية من طائرات بدون طيار2بلغت أيام المهرجان المحددة له عند إطلاقه في 11 أكتوبر 2019 في العاصمة الرياض 70 يوما ثم جرى تمديده بعد وصول عدد الزوار إلى أكثر من 7 ملايين شخص3 حيث مُدّدَ في عدة مناطق منها ونتر وندرلاند والمربع والسفاري وصحارى الرياض إلى 18 يناير 2020 وفي منطقة الرياض بوليفارد إلى نهاية شهر مارس 20204 وصل عدد فعاليات المهرجان إلى أكثر من 100 فعالية توزعت على 12 موقعا بمساحة 14 مليون متر مربع56 وقام على تنفيذه 280 شركة سعودية7بلغ عدد فعاليات موسم الرياض أكثر من 100 فعالية يومية تنوعت بين العروض الحماسية والحياة البرية والمطاعم والمقاهي والماركات العالمية بالإضافة لعروض السيارات والمزادات والألعاب والحفلات الشرقية والأجنبية والتراث والفن ومن هذه الفعاليات معرض الصيد والصقور السعودي مهرجان فيراري كرنفال الرعب بارك التزلج الحديقة الساحرة فوت بارك ليالي عدن ليالي المحروسة فرقة «بي تي اس» الكورية تجربة نيرف تجربة مارفل النافورة الراقصة8910جدول فعاليات موسم الرياض من الفترة 11 أكتوبر حتى 15 يناير 2020حدد موسم الرياض 12 منطقة لفعالياته على مساحة 14 مليون متر مربع هي الرياض بوليفارد وواجهة الرياض ومعرض الرياض للسيارات ورياض ونتر وندرلاند وملاعب الرياض والحي الدبلوماسي والمربع والملز ووادي نمار ونبض الرياض ورياض سفاري ورياض صحارى11انطلق موسم الرياض في موسمه الثاني في 20 أكتوبر 2021 بمسيرة استعراضية ضمت أكثر من 1500 مؤدٍ بأزياء تنكرية بحضور عدد من الشخصيات الشهيرة من أبرزهم المصارع أندرتيكر و 2760 طائرة درون إضافة إلى عروض مخصصة لرقصة السامري كما رافق حفل إطلاق الموسم الذي حمل شعار «تخيل أكثر» وحضره أكثر من 750 ألف شخص في منطقة بوليفارد رياض سيتي حفل الفنان العالمي «بيتبول»1213تضمن موسم الرياض 2021 أكثر من 7500 يوم فعالية موزعة على 14 منطقة للترفيه في الرياض واشتملت على 70 حفلة غنائية عربية و 6 حفلات غنائية عالمية إضافة إلى 10 معارض عالمية و 350 عرضا مسرحيا و 18 مسرحية عربية و 6 مسرحيات عالمية بالإضافة إلى بطولة واحدة للمصارعة الحرة ومباراتين عالميتين و 100 تجربة تفاعلية إلى جانب 200 مطعم و 70 مقهى بالإضافة إلى ممشى بطول 3 كيلومترات و4 مسارح وأرينا عالمية و 500 لعبة إلكترونية و 9 استوديوهات عالمية وملعب غولف و 12 ملعب بادل تنس وأول وأكبر سكاي لوب متنقل في العالم بطاقة استيعابية تتجاوز 40كما تضمنت الفعاليات أمسيات شعرية فضلا عن معرض خاص للشعر وعروض شعرية للمحاورة بالإضافة إلى تجربة القتال في 5 عصور وركوب الدبابات الحربية والرماية بالذخيرة الحية و 15 ميدان رماية تفاعلياوشملت فعاليات الموسم تقديم تجربة الشجرة العملاقة ومنطقة للتفاعل مع الحيوانات الأليفة ورحلات سفاري إضافة إلى مهرجان الرياض للألعاب ومهرجان الأنمي السعودي ومعرض للألعاب الإلكترونية ومعرض للعطور وأخرى للمجوهرات ومعرض للسيارات والكثير من العروض الفنية والموسيقيةكذلك اشتملت الفعاليات على مشاركة 7 مطاعم عالمية و 3 مقاهٍ عالمية ضمن الموسم لأول مرة بالمملكة بالإضافة إلى حفلات موسيقية وعروض ترفيهية شعبية كما تضمنت مشاركة فندق عالمي بسعة 100 غرفة وسينما فاخرة ب 7 شاشات عرض و 23 متجرا من أرقى الماركات العالميةوأعلن رئيس مجلس إدارة الهيئة العامة للترفيه في السعودية المستشار تركي آل الشيخ عن مشاركة ميسي إلى جانب البرازيلي نيمار والفرنسي كيليان مبابي في مباراة كرة قدم استعراضية في العاصمة الرياض بين نجوم الهلال والنصر ضد باريس سان جيرمان الفرنسي14بلغ عدد مناطق الفعاليات 14 منطقة هيتقع في حي حطين شمال الرياض وهي أكبر مناطق فعاليات الموسم15 يمثل بوليفارد الرياض مجمعا مفتوحا بمساحة 900 ألف متر مربع حيث تضاعفت مساحته في العام 2021 ثلاثة أضعاف لاستيعاب 9 مناطق ثانوية ويضم 200 مطعم ومقهى ومتجر متنوع مع ممشى بطول 3 كلم و 9 استديوهات عالمية و 4 مسارح عربية وعالمية وكذلك منطقة مخصصة للأطفال تحتوي على 500 لعبة إلكترونيةكما يضم فندقاً بخدمات خمس نجوم على طراز بوتيك هوتيل بالإضافة إلى ناد صحي ومكاتب تجارية16تضم المنطقة العديد من المطاعم والمقاهي الفاخرة بما يقارب 15 مركزًا إضافة إلى فندق عالمي يحمل تصنيف 5 نجوم بسعة 100 غرفة إضافة إلى سينما حديثة بسبع شاشات عرض ومسرح بمقاييس عالمية كما يوجد في المنطقة 23 متجرًا لعدد من العلامات التجارية العالمية17هي إحدى مناطق فعاليات موسم الرياض الترفيهي العالمي الذي يقام في مدينة الرياض عاصمة المملكة العربية السعودية وتشرف عليه الهيئة العامة للترفيه18تقع منطقة كومبات فيلد شمال شرقي الرياض وهي منطقة مختصة بالمنافسات الترفيهية القتالية والعروض الحركية وتقع على مساحة تتجاوز 300 ألف م2تقع في شمال العاصمة الرياض بجوار مركز الملك عبد الله المالي19 تضم 6 مناطق توفر أكثر من 103 ألعاب للكبار والصغار وأنشطة وعروضًا ترفيهية إضافة إلى فعاليات عدة تقام وسط أجواء شتويةوتشمل المناطق ال 6 منطقة «دريم لاند كرنفال» ومنطقة «غابة الثلوج» ومنطقة «صندوق الألعاب السحرية» المخصصة للأطفال ومنطقة «مغامرات الرعب» ومنطقة «طريق العجائب» ومنطقة «المهرجان الشتوي»هي وجهة للأعمال والترفيه والتسوق والضيافة تقع في شمال مدينة الرياض عاصمة المملكة العربية السعودية على الطريق المؤدي إلى مطار الملك خالد الدولي وتضم بيئة أعمال تحتضن أكثر من 6000 موظف كما تجمع كبرى الشركات المحلية والإقليمية والعالمية20وتحتضن واجهة الرياض عددا من الفعاليات على مدار العام كما تعد إحدى مناطق فعاليات موسم الرياض الترفيهي الذي تشرف عليه الهيئة العامة للترفيه21هي إحدى مناطق فعاليات موسم الرياض الترفيهي العالمي الذي يقام في مدينة الرياض عاصمة المملكة العربية السعودية وتشرف عليه الهيئة العامة للترفيه22تضم منطقة المربع عددا من الفعاليات والمواقع التاريخية والحديثة التي استثمرتها الهيئة العامة للترفيه لإقامة الفعاليات بالإضافة إلى تجربة التنقل بين المسارات المضيئة ليلًا التي تتضمن إطارات الأعمال الفنية للمتحف الوطني السعودي وهو أول محطة يصل إليها الزوار خلال جولتهم بعربات الجولف ويقدم معلوماتٍ حول تاريخ المملكة واللغة العربية والدين الإسلاميوتنظم منطقة المربع داخل مساحاتها عددًا من الفعاليات المختلفة إلى جانب بروتوكول الاستقبال الرسمي للزوار الذي يبرز سمات الضيافة السعودية من خلال الترحيب وتقديم القهوة العربيةوبالإضافة إلى المطاعم العالمية التي تستضيفها منطقة المربع يمثل الطابع العام لبعض المطاعم نموذجًا لأحد البيوت الطينية القديمة بمكوناته المتمثلة في الليوان والقبة اللذين يمثّلان أهم أجزاء البيت النجدي قديمًا2324تتضمن رياض سفاري متنزهًا سياحيًا ضخمًا وبحيرة صناعية وحديقة مغلقة إضافة إلى مسرح مفتوح وعروض متنوعة في أجواء مفعمة بالحيوية والإثارةوتضم رياض سفاري مجموعة كبيرة من أصناف الحيوانات وفصائلها في منطقة مكشوفة تعيش في أرجائها الفيلة والنمور والغزلان ضمن بيئة تمزج بين الأجواء الباردة والأرض الخصبة كما أكثر من 250 نوعًا وفصيلة للطيور منها ثلاثة أنواع من طير «كوكاتو النخيل» وهو من الفصائل شبه المنقرضة من الطيور وتصل القيمة السوقية للطائر إلى نحو 90 ألف ريال ويعد أحد أكبر الببغاوات في العالم ويميزه من بين الطيور وجهه الأحمر ولونه الأسود اللافت كما يتزين بريش يشبه التاجوينتشر في المنطقة عدد من الطيور الناطقة والمتميزة بألوانها التي تصل أعمار بعضها إلى 27 عامًا كما تستضيف المنطقة طير «القالا» الذي يعد ضمن أندر الطيور في العالم ويُعرف بعيشه في النوافذ والأشجار في قارة أستراليا25سميت بهذا الاسم لوصفها بالعذرية حيث تقع في شمال مدينة الرياض وتحتوي على مظاهر الحياة الصحراوية الطبيعية التي لم تمسها يد المدنية الحديثة وتشتهر تلك المنطقة أيضا بزراعة نبات العاذرتضم عدداً كبيرا من المطاعم والمقاهي من مختلف الأذواق كما تحوي مطاعم عالمية في أجواءٍ تجمع بين الحداثة والتراث السعوديومن أهم ما يميِّزها الجلسات الخارجية الشتوية الأصيلة والوجبات العصرية26تتخذ أوايسس موقعا صحراويا شمال العاصمة الرياض يمتد على مساحة 13 مليون م2 تتقاسمها ثماني مناطق تحوي مطاعم ومخيمات ومتاجر للتسوق ومواقع للحفلات إضافة إلى الألعاب الترفيهية والفعاليات الفنيةوتحوي المنطقة عددًا من زوايا الفن التي تتخذ من الرمال متحفًا تستعرض فيه أعمال الفنانين السعوديين من منحوتات وجداريات وفن الجرافيتي الذي يعكس الثقافة النجديةوتتوفر للزوار جلسات بين النخيل على أنغام الموسيقى والمطاعم الإيطالية وتضم أكثر من 25 علامة تجارية محلية ودولية ودورا للأزياء والإكسسوارات والمنتجات الشبيهة بالثقافة السعوديةتشمل أوايسس ثماني مناطق رئيسة تتمثل في منطقة التسوق تراث نجد المنطقة الترفيهية الفنون مطاعم عالمية دكة الأوايسس اللاونجات الموسيقية منطقة glamps27تضم عناصر للاسترخاء ووسائل للتمتع بالرفاهية إضافة إلى مجموعة مختارة من المقاهي والمطاعم الفاخرة وفعاليات ترفيهية وورش فنية متنوعةوتعد Birds of Eden من أبرز فعاليات «ذا جروفز» وتقدم وجبات خفيفة تضم تشكيلات واسعة من الأطعمة إضافة إلى فعالية «الجلسة» التي تجمع الزوار بمحبيهم للجلوس والتمتع بالمذاقات الخفيفة المتنوعة ضمن مناظر طبيعية وأجواء موسيقية راقيةوتقدم فعالية Gemini للزوار مزيجًا من الأطعمة التي اجتمعت فيها أساليب المطبخ الياباني وأسرار المطبخ الإيطالي كماتقدم El Lechazo وجبات من المطبخ الإسبانيوتجمع فعالية PassionFashion بين الفن والموضة من خلال عرض أزياء يشمل عددًا من الفعاليات الموجهة لمحبي الموضة والأزياء فضلًا عن فعالية Milk  Butter nail spa التي تقدم أفضل الممارسات العالمية في مجال الاستجمام28تقع منطقة «نبض الرياض» وسط الرياض بجوار قصر المصمك وتنقسم إلى مناطق فرعية تُقام فيها العديد من الفعاليات منها منطقة «ساحة الصفاة» وتحتوي على مجسمات فنية لفنانين محليين وعروض متنوعة تشمل الرسم على الرمل والرسم بمربع روبيك وفن الشارع «ثلاثي الأبعاد» وفن الجليتر وعروضاً مسرحية وموسيقيةكما تتوفر في الساحة قهوة الصفاة وهي قهوة تراثية بنمط عصري تُقدم فيها المشروبات والحلويات التقليديةومن المناطق الفرعية أيضاً منطقة «ساحة المصمك» التي تتضمن عروضاً فنية ومسرحية وأخرى تفاعلية إضافة إلى مسرح نبض الرياض الذي تُقام فيه 30 عرضاً موسيقياً بمشاركة أكثر من 30 فرقة ومغنياً من مختلف أنحاء العالم وعروض أوركسترا محلية وعالمية تشمل أداء السمفونيات والموسيقى العربية والعالميةكما تنظم منطقة «ساحة المصمك» عروضاً فنية وعالمية للفنان «آش» وهو موسيقي ومنتج له عدد من المقطوعات الموسيقية ويعزف على آلات موسيقية عديدة والذي أحيا أمس أولى فعاليات المنطقةوتشتمل فعاليات نبض الرياض على عروض مرئية تسرد القصص الثقافية والتاريخية عن مناطق السعودية منذ بداية تأسيس الدولة ومحاكاتها على جدران قصر المصمك إلى جانب عروض فلكورية تجسد التقاليد والموروث الثقافي السعودي كما تشمل الفعاليات عروضاً ترفيهية وموسيقيةكما تشتمل على مطاعم ومقاهي وأكشاك للوجبات السريعة ويؤدي العروض الفلكلورية فرق تمثل وسط السعودية وغربها وشرقها وشمالها وجنوبها بالاستفادة من المواهب المشاركة على منصة مطلوب29تقع في حي غرناطة في العاصمة الرياض وتستهدف جميع شرائح المجتمع وفئاته العمرية من العائلات والأطفال والأفراد وتقدم فعاليات عديدة للمهتمين بالتراث والثقافة والفنون والموسيقى30تضم المنطقة مسرحًا تُقدم فيه الحفلات الغنائية والعروض البصرية إضافةً إلى العروض الفردية وحديقة الورود الواسعة والأنشطة المتنوعةوتمثل شجرة السلام أيقونة المنطقة وهي شجرة صناعية مضيئة شبيهة بالخيال يبلغ ارتفاعها أكثر من 12م وتنبعث منها إضاءات تزين المكان إضافة إلى عروض بتقنية «إل إي دي» بالتزامن مع موسيقى تصويريةوتمتد فعاليات منطقة شجرة السلام على مساحة 50 ألف م2 وذلك في متنزه السلام جنوب غربي مدينة الرياض وتتضمن عدة أنشطة وعروضا في مكان مفتوح بجوار مطاعم فاخرة ومناطق تسوق متعددةوتحتوي المنطقة على حديقة الورود «إكزوتيكا» وهي حديقة صناعية للزهور بمساحة 2500 م2 وتستعرض المواهب المحلية فنونها في الحديقة وفي الموقع مجسمات تمثل الكائنات البحرية والطيور ومراجيح مزينة بالورود الطبيعية والصناعية ومحلات للتسوق وأخرى لأصحاب المشاريع الصغيرة وسوق للمزارعين يعرضون فيه منتجاتهموتضم فعاليات «شجرة السلام» منطقة مخصصة للطبخ الحي إذ يقدم نحو 5 طهاة سعوديين أطباقًا مختلفة من الأطعمة إضافة إلى مكان مخصص للعروض الفرديةوتشمل الفعاليات أيضًا الرسم الحر ومتاهة ضخمة ومنطقة التزحلق بالدراجات وغير ذلك ضمن منطقة فعاليات خارجية إلى جانب منطقة الأطفال التي تضم مسرحاً صغيراً يقدم عروضاً للأطفال كعرض البالونات والفقاعات والرسم على الوجه ومجسمات تفاعليةوتضم فعاليات الكبار في منطقة «شجرة السلام» عروضًا متجولة مضيئة في الفترات المسائية لتعكس الطابع العام للمتنزه ومسرحاً لتقديم عروض متنوعة في عطلة نهاية الأسبوع كعروض راقصي الإضاءة ومقدمي الألعاب البهلوانية31تعد «خلّوها» إحدى مناطق فعاليات موسم الرياض 2021 وتتضمن عدة فعاليات متعلقة بالطابع الثقافي والتراثي وجذب محبي الشعر وهي تُقام في حي الرمال شمال شرقي العاصمة الرياض خلال أيام نهاية الأسبوع والتي انطلقت فعالياتها في ال 25 من نوفمبر 2021م وتضم مناطق الرّدّية المجلاس معرض الشعر منطقة المركى منطقة فلة حجاج32جدول فعاليات موسم الرياض خلال شهر أكتوبر 2021فعالية WWE محمد عبده أريناالأوركسترا المصرية محمد عبده أريناالأوركسترا المصرية محمد عبده أريناأقيم عرض المصارعة المحترفة كراون جول 2021 على مسرح محمد عبده بمشاركة عدد من نجوم WWE مثل راندي أورتن وإيدج كما حضر بطل الكاراتيه الأولمبي السعودي طارق حامدي لمساندة نجم المصارعة منصور الشهيل33هو مهرجان ألعاب إلكترونية وأحد فعاليات موسم الرياض انطلق في العاصمة الرياض في 22 أكتوبر 2021 ويستمر مدة 5 أيام ويتضمن المهرجان منافسات وتحديات في مجموعة من الألعاب منها تكن 7 ببجي أوفر ووتش فيفا 2022 كول أوف ديوتي وغيرها ويصل مجموع جوائزها مليون ريال إضافة لمنافسات ونهائيات منقولة عبر منصات Facebook Gaming Twitch YouTube Gaming وعروض مسرحية مباشرة ومسابقة «الكوسبلاي»34يقام مهرجان الرياض للألعاب في منطقة «واجهة الرياض» خلال الفترة 12 حتى 21 نوفمبر تحت شعار «اكتشف ألعب تسوق» ويعد الأكبر من نوعه في العالموتشمل أبرز الشركات الموجودة في المهرجان ديزني ماتيل للألعاب هاسبرو توي برو شركة Moonbug المسؤولة عن إنتاج برامج الأطفال الترفيهية شركة MGA للألعاب شركة pocketwatch35أقيمت فعالية سيرك دو سوليه في منطقة «بوليفارد أرينا» إحدى مناطق بوليفارد رياض سيتي وتناولت قصة اللاعب الأرجنتيني ليونيل ميسي ومواجهته للتحديات إلى أن أصبح من أساطير كرة القدم على المستوى العالمي36تعد فعالية Hack أكبر حدث عالمي للأمن السيبراني في منطقة الشرق الأوسط وتقام خلال الفترة 28  30 نوفمبر 2021 في «واجهة الرياض» إحدى المناطق الترفيهية لموسم الرياض 2021 وتهدف الفعالية التي تأتي بالشراكة مع الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز وشركة Informa Tech مع شركةBlack Hat والشريك والممكن الرقمي stc  إلى زيادة الوعي بمخاطر الأمن السيبراني والتصدي لها وتبادل آخر المستجدات في هذا المجال وسط حضور أكثر من 200 متحدث ومدرِّب و200 شركة رائدة وناشئة من حول العالم الذين يقدمون حلولهم ومنتجاتهم في مجال الأمن السيبرانيوتشمل أقسام فعالية Hack قسم القمة التنفيذية المخصصة لصفوة الخبراء في الأمن السيبراني لمناقشة آخر مستجدات المجال وقسم ورش العمل التقنية التي يعرض فيها المبرمجون أبرز الأدوات ذات المصدر المفتوح وأحدث الأبحاث والدراسات وتطورات مجال الأمن السيبراني وقاعة الأعمال التي تعرض أبرز خدمات ومنتجات تقنية المعلومات إضافةً إلى قسم المساحة التفاعلية بهدف بناء العلاقات المهنية ومعرفة أحدث التطورات التقنية وسط وجود العديد من الأنشطة الترفيهيةكما تحتوي أقسام الفعالية على قسم تحديات الأمن السيبراني الذي يقدم مجموعة جوائز تصل قيمتها إلى 1000000 ريال وهي مقسمة على تحديين الأول تحدي «التقط العلم» بمنافسة بين أفضل 1000 مشارك وتحدي منصة مكافآت الثغرات ويستمر ثماني ساعات متواصلة على أن يتم إعلان الفائزين في اليوم الأخير من الفعالية37في 4 نوفمبر 2021 أعلن رئيس الهيئة العامة للترفيه تركي آل الشيخ دخول موسم الرياض موسوعة غينيس وحصوله على شهادتين عالميتين كأكبر حدث ترفيهي شامل بالإضافة إلى تحطيم لعبة الزحليقة العملاقة إحدى أبرز فعاليات «بوليفارد رياض سيتي» وتقع في منطقة «أفالانش» الرقم القياسي بارتفاع وصل إلى 22136 مترًا وطول بنحو 117م وعرض 565م في حين بلغ عدد مساراتها 24 مسارًا3839حملت النسخة الثالثة من موسم الرياض لعام 2022 شعار «فوق الخيال» لتشير إلى التوسع الكبير في هذه النسخة على مستوى المناطق والفعاليات وفق ما أعلنه رئيس مجلس إدارة الهيئة العامة للترفيه تركي آل الشيخ لدى إطلاقه هوية النسخة الثالثة من موسم الرياض في 7 سبتمبر 202240انطلقت النسخة الثالثة من موسم الرياض في 21 أكتوبر 2022 واستمرت حتى مارس 2023 وتضمن ذلك 8500 يوم نشاط كان لهذا الموسم 15 منطقة رئيسية في بوليفارد وورلد ومثلت العديد من الثقافات مثليتضمن موسم الرياض 2022 أيضًا كأس موسم الرياض وهي مباراة كرة قدم ودية بين باريس سان جيرمان PSG وفريق الرياض XIفريق الهلال والنصر المشترك أقيمت في استاد الملك فهد الدولي في 19 يناير 2023 حظيت باهتمام عالمي حيث شارك في المباراة ليونيل ميسي وكريستيانو رونالدو وهما من أعظم لاعبي كرة القدم في العالم وموضوع نقاش حاد ضد بعضهما البعض مباشرة لأول مرة منذ عام 2020 حيث لعب ميسي لفريق باريس سان جيرمان وانضم رونالدو إلى النصر قبل أيام من المباراة الودية وفاز باريس سان جيرمان بالمباراة 54بعد موسم الرياض 2022 أعلنت الهيئة العامة للترفيه عن إطلاق موسم الرياض 2023 بهوية وشعار جديدين «Big Time» ورعاية البنك الأهلي السعودي يتضمّن فعاليات متنوعة في العاصمة الرياض على مدار العام يشمل ذلك مناطق مثل ذا جروفز وبوليفارد وورلد وبوليفارد رياض سيتي ومنطقة جديدة باسم «بوليفارد هول» تتسع لأكثر من 40 ألف زائر في وقت واحد41 بالإضافة إلى مناطق أخرى في أجزاء مختلفة من العاصمة تتضمن الفعاليات تفاصيل حول نوع الفعالية وآلية الحجز وتواريخ وأوقات الدخول إلى كل منطقة42ويتضمن موسم الرياض على مجموعة من الأحداث والفعاليات الترفيهية المتنوعة كما يضم عددا من الخيارات الترفيهية في مجالات العروض المسرحية والحفلات والتسوق إضافة إلى المطاعم والمقاهي المحلية والعالمية ومجموعة من التجارب والفعاليات الجديدة وعروض الألعاب النارية4344أقيم الحدث الافتتاحي ومعركة الأسوأ بالإنجليزية Battle of Baddest‏ والذي شارك فيه تايسون فيوري وفرانسيس نغانو في بوليفارد هول في اليوم نفسهسيتميز موسم الرياض هذا العام بإضافة بوليفارد هول أو قاعة بوليفارد التي سميت المملكة أرينا لأسباب تتعلق بالرعاية وهي ساحةأرينا داخلية بها ملعب كرة قدم متوافق مع الاتحاد الدولي لكرة القدم والاتحاد الآسيوي لكرة القدم قادر على استضافة أنواع مختلفة من الأحداث بحضور أكثر من 40 ألف متفرج 27 ألف متفرج لمباريات كرة قدم سيتم افتتاحه بالكامل في يناير 2024 وسيكون بمثابة الملعب الرئيسي الجديد للهلالولأول مرة في العالم يقام مهرجان لبطولة الكلاب في الرياض يومي 30 نوفمبر والأول من ديسمبر 2023م45 وفي 29 ديسمبر 2023 أُلغِيَت مباراة السوبر التركي لكرة القدم بين فريقي فنار بخشة وغلطة سراي على ملعب الأول بارك في العاصمة الرياض نظراً لعدم الالتزام بالأنظمة والقوانين المتفق عليها وفق ما جاء ببيان صادر عن موسم الرياض4647 وفي يناير 2024 صرح رئيس مجلس إدارة الهيئة العامة للترفيه في السعودية المستشار تركي آل الشيخ عبر حسابه على منصة إكس  أن موسم الرياض الذي انطلق في أكتوبر 2023 وصل إلى 12 مليون زائر خلال 60 يوماً مؤكداً أن هذا الرقم كان هو المستهدف خلال كامل موسم الرياض ولكنه تحقق في منتصف الموسم48وفي 21 يناير  وضمن فعاليات موسم الرياض 2023 انطلقت النسخة الرابعة من جوائز صناع الترفيه 2024  حفل توزيع جوائز صناع الترفيه 2024 في العاصمة السعودية الرياض بحضور عالمي وعربي لافت وأقيم الحفل في بوليفارد رياض سيتي بمسرح بكر الشدي وشهد الحفل مفاجآت ضخمة كان أبرزها حضور نخبة من أكبر النجوم العالميين وعلى رأسهم أنتوني هوبكنز ومارك والبرغ وكيفين كوستنر ومارتن لورانس والنجم الفرنسي جان رينو والنجم الأميركي جون سينا والنجم الهندي سلمان خان ومواطنته النجمة عليا بهات49وفي 9 مارس 2024 تم اختتام موسم الرياض 2023 حيث أعلن رئيس مجلس إدارة الهيئة العامة للترفيه في السعودية المستشار تركي آل الشيخ في ختام موسم الرياض 2023 أن عدد الزائرين في موسم الرياض 2023 بلغ 20 مليون زائر50 وفي 28 مارس 2024 نشر رئيس الهيئة العامة للترفيه تركي آل الشيخ عبر حسابه الرسمي في  إكس إحصائيات ظهور موسم الرياض 2023 على منصات التواصل الاجتماعية ب 24 مليار مرة كرقم قياسي جديد بين 150 دولة في حين سجل عدد التفاعل 436 مليونا ل 4075 منشورا على 13 منصة شاهدها 165 مليار شخص51هناك 12 منطقة في موسم الرياض 20231 بوليفارد وورلد2 بوليفارد سيتي3 المملكة أرينا بوليفارد هول4 رملة تيرازا5 فيا رياض6 وندر جاردن الحديقة العجيبة7 مهرجان الفود ترك عربات الطعام578 حديقة حيوان الرياض9 روشن فرونت واجهة روشن10 ذا قروفز11 سوق الأولين12 حديقة السويديفي 12 أكتوبر 2024م أعلن رئيس مجلس إدارة الهيئة العامة للترفيه GEA المستشار تركي بن عبد المحسن آل الشيخ انطلاق النسخة الخامسة من موسم الرياض لعام 2024 من منطقة المملكة أرينا62 وأقيم الموسم على مساحة أكثر من 72 ملايين متر مربع تم فيها إبرام 4200 عقد مع 2100 شركة 95 في المئة منها محلية إلى جانب إقامة 11 بطولة عالمية و10 معارض ومهرجانات متنوعة6364","score":4
  },
  {
    "title": "منظومة سطر التعليمية",
    "article": "تعديل  تعديل مصدري  تعديل ويكي بياناتمنظومة سطر التعليمية منصة طويق التعليمية سابقًا أطلقتها أكاديمية طويق تحت شعار «أول منصة عربية متخصصة في مجالات التقنية الحديثة باللغة العربية»1 وهي منظومة تعليمية إلكترونية تحوي دروسًا تفاعلية مُسجلة لعدة مجالات برمجية تتضمن تطوير الويب وتطوير تطبيقات الهواتف المحمولة إدارة نظام التشغيلتهدف المنصة إلى إثراء المحتوى العربي في مجال تعليم البرمجة وتقديم محتوى عربي سعودي مجاني2 والتحديات في مجال البرمجة3أعلن عن منصة سطر التعليمية بشكل رسمي في حدث LaunchKSA في أوخر عام 2021 وصممت المنصة بجهود مبرمجين سعوديين بالتعاون مع أكاديمية طويق وشركة الاتصالات السعودية والاتحاد السعودي للأمن السيبراني والدرونز4تهدف المنصة إلى تقديم محتوى تعليمي بروح سعودية وتوفر محتوى متنوع ومتكامل غير مدفوع بالإضافة إلى أنه يتم تحديث محتواها بشكل دائم ومتجدد لتعلم لغات البرمجة والتقنيات الحديثة بكل سهولة ومتعة5هي منصة مقدمة من الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز بالتعاون مع الأكاديمية من خلال منصة سطر تحت شعار «أول منصة عربية متخصصة في التحديات البرمجية»6 وتهدف إلى وضع تحديات برمجية تمكن المتدربين في المنصة من اختبار قدراتهم البرمجية ومستوى تعلمهم من خلال حل تحديات برمجية متعددة ومختلفة في مستوى الصعوبة وعند حل التحديات يتم إضافة شارة إلى ملفاتهم الشخصية في المنصةفي منتصف عام 2022 اُضيفت مساحات سطر وألغيت منصة الإعتمادات لأسبب غير معروفة وحُذفت كل الوصلات والمعلومات المتعقلة بها حيث كانت توفر المنصة إمكانية التقديم لإجراء اختبارات من أجل الحصول على شهادة إعتماد وذلك من خلال منصة الإعتماد في سطر ويتم إضافة الشهادة إلى ملفاتهم الشخصية في المنصةتوفر خدمة المساحة التعليمية وتتيح إمكانية مراقبة تقدم مجموعة من المستخدمين المسجلين بالمنصة في العملية التعليمية والاطلاع على الدرجات ومستوى تقدمهمبعد انطلاق معسكر طويق 1000 أنشئت الأكاديمية منصة رسمية كوسيلة إعلان رسمية للفعاليات البرمجية والسيبرانية التي يوفرها الاتحاد السعودي للأمن السيبراني والبرمجة والدرونز بالشراكة مع أكاديمية طويق","score":5
  },
  {
    "title": "جامعة الإسراء (العراق)",
    "article": "جامعة الإسراء هي جامعة أهلية تقع في مدينة بغداد في العراق تأسست في 21 فبراير 2013افتتحت الكلية في سنتها الأولى خمسة اقسام علمية ثم اتسعت ليصبح عدد الأقسام احدى عشر قسماً علمياً وانسانياً وبتوسع اخر للكلية اصبح عدد الأقسام حاليا واحد وعشرون قسما1أعلن عن تحويل كلية الإسراء الجامعة إلى جامعة الإسراء في 12 نيسان 20232تضم الكلية 12 كلية وهي3هذه بذرة مقالة عن موضوع عن التعليم في العراق بحاجة للتوسيع فضلًا شارك في تحريرها","score":0
  }
]